<HTML>

<HEAD>
<!-- erstellt: 03.06.1996 09:59:24 -->
<TITLE>Atari Karts</TITLE>
</HEAD>

<BODY>
<H1>Atari Karts</H1>
<HR>
<H3>Atari Karts, der Super Mario Kart-Killer?</H3>

<P ALIGN=justify>Wer darauf eine Antwort erhalten m&ouml;chte sollte weiterlesen, alle anderen
ausserdem auch... Nun, Atari Karts hat erstmal nat&uuml;rlich farbigere und
schneller Grafik als der SNES-Megahit. Auch die Musik und Soundeffekte
sind gut gelungen, spielerisch gibt es aber deutlich Defizite gegen&uuml;ber
Super Mario Kart, da es bei Atari Karts viel zu wenig Spielmodi gibt.</P>

<P ALIGN=justify>W&auml;hrend man bei Super Mario Kart sogar einen Battle-Modus und Rekord-Runden
fahren kann, bleibt bei Atari Karts nur das Rennen alleine oder zu zweit
(Split-Screen) gegen die Computergegner &uuml;brig. An Schwierigkeitsstufen gibt
es vier St&uuml;ck (Super Mario Kart: drei), wobei die ersten zwei Schwierig-
keitsstufen viel zu einfach sind. Die Dritte ist etwas schwieriger und die
vierte Schwierigkeitsstufe ist alleine fast unl&ouml;sbar!</P>

<P ALIGN=justify>Am Anfang der Spiels stehen dem Spieler bei Atari Karts sieben unterschied-
liche unbekannte Comic-Fahrer zur Verf&uuml;gung, welche spezielle F&auml;higkeiten
in der Beschleunigung, Steuerung und H&ouml;chstgeschwindigkeit haben. Nachdem
eine Schwierigkeitsstufe gel&ouml;st wurde kommt ein Neuer, etwas besserer
Fahrer hinzu. Zum Vergleich bietet Super Mario Kart insgesamt achte wesent-
lich popul&auml;re Charakteren. Auch bei bei den Extras wurde geschlampt, es
gibt bei Atari Karts nur wenig unn&uuml;tze Extras wie z.B. der Beschleuniger
oder Lenkumkehrung f&uuml;r den Spieler oder Gegenspieler.</P>

<P ALIGN=justify>Ich habe wirklich die gr&uuml;nen und roten Schildkr&ouml;ten-Panzer, den Pilz,
sowie die Banane von Super Mario Kart vermisst. Welche wirklich geniale
Extras waren und den Spielspass enorm erh&ouml;ht haben.</P>

<P ALIGN=justify>Die Steuerung wurde ansonsten optimal gel&ouml;st, aber der neue ProController
wird absolut ben&ouml;tig, da die L- und R-Taste f&uuml;r das Driften um die Kurven
benutzten werden, welches sich mit den alten Pad (4-/6-Knopf) schlecht
bewerkstelligen l&auml;sst, d.h. ohne einen ProController ist es quasi unm&ouml;glich
den h&ouml;hsten Schwierigkeitsgrad durchzuspielen. W&auml;hrend des Spiel ist es
ausserdem sehr &auml;rgerlich, dass man in der Grafik h&auml;ngen bleiben kann und
bis man wieder daraus gel&ouml;st hat sind einige Pl&auml;tze verlorengegangen,
zudem sind Ber&uuml;hrungen mit den gegnerischen Computer-Gegner nicht zu
empfehlen, da man immer den K&uuml;rzeren zieht!!!</P>

<P ALIGN=justify>Fazit: Atari Karts ist ein gutes kurzweiliges Rennspiel, welches aber
spielerisch dem &uuml;ber 3 Jahre alten Oldie nicht im Geringsten das Wasser
reichen kann... Wirklich schade, sonst w&auml;re die Wertung wesentlich h&ouml;her,
aber so bleibt nur die Note: "Gut".</P>


<TABLE ALIGN=center BORDER><TR><TH>Grafik </TH><TD>85 %</TD></TR>
<TR><TH>Sound  </TH><TD>80 %</TD></TR>
<TR><TH>Gesamt </TH><TD>80 %</TD></TR></TABLE>


<HR>
</BODY>

</HTML>