<HTML>

<HEAD>
<!-- erstellt: 03.06.1996 09:46:12 -->
<TITLE>Baldies</TITLE>
</HEAD>

<BODY>
<H1>Baldies</H1>
<HR>

<H3>Wo Baldies hinlangen w&auml;chst kein Gras mehr!</H3>

<P ALIGN=justify>"Schon mal die Welt beherrschen gewollt?" - NEIN! Dies ist kein Satz aus
der Atari Inside, sondern hier zeigt Atari wieder die &uuml;berragenden F&auml;higkeiten der &Uuml;bersetzer. Aber worum handelt es sich eigentlich?</P>

<P ALIGN=justify>Baldies ist ein Strategie-Spiel und man k&ouml;nnte es aus einen Mix aus Populous,
Siedler und MegaLoMania beschreiben. Der Spieler ist der Sch&ouml;pfer und die
Aufgabe besteht darin sein Team von Baldies Befehle zu erteilen und mit
Liste und T&uuml;cke die gegnerischen Baldies aus den jeweiligen Levels zu
beseitigen. Dazu stehen dem Spieler unterschiedliche Waffen zur Verf&uuml;gung,
die im Laufe des Spiel erfunden werden. Insgesamt gibt es 100 Levels!
5 Welten a 20 Levels, wobei die Welten vom "gr&uuml;nen Land", Eiswelt, Zirkus-
Welt, W&uuml;ste bis hin zur H&ouml;lle reichen. Wenn der Spieler ein Level komplett
von seinen Konkurenten befreit hat geht es ins n&auml;chste Level und der Spieler
bekommt ein Passwort oder kann den Spielstand auf der Memory Track Card ab-
speichern. Positiv kann erw&auml;hnt werden, dass Baldies das erste CD-Spiel ist,
dass die Memory Track Card gar nicht ben&ouml;tigt, da die Passw&ouml;rter absolut
gleichwertig sind.</P>

<P ALIGN=justify>Spielerisch klickt der Spieler mit seinem Joypad rum (wo bleibt die Maus
f&uuml;r den Jaguar?) und wir k&ouml;nnen den Baldies in vier Bereiche einteilen:</P>

<P ALIGN=justify><FONT COLOR="RED">Rot</FONT>/Arbeiter - Die Standard-Baldies. (Zu Beginn einer Spielstufe sind alle
Baldies Arbeiter, bis ihnen andere Aufgabe zugewiesen werden). Arbeiter sind
sehr n&uuml;tzlich... Sie sind die einzigen Baldies, die andere Baldies erzeugen
k&ouml;nnen! Aber diese Art der Fortpflanzung geht nur in einem Haus. Laufen Sie
hingegen ausserhalb der H&auml;user rum, tr&auml;gt ihre Arbeitskraft zur St&auml;rkung
der roten Anzeige bei, die den Spieler &uuml;ber die H&ouml;he der verf&uuml;gbaren
Arbeitskraft informiert, mit der man Werkzeuge benutzen kann.
</P>
<P ALIGN=justify><FONT COLOR="BLUE">Blau</FONT>/Konstrukteur - Wenn man ein Haus bauen m&ouml;chte ben&ouml;tigt man diese
Baldies, auch kann dadurch ein Geb&auml;ude ausgebaut oder renoviert werden.
Je gr&ouml;sser ein Haus ist desto mehr Konstrukteure werden ben&ouml;tigt um alles
in Schuss zu halten. In gr&ouml;sseren H&auml;user ist die Vermehrungsrate gr&ouml;sser
und solche H&auml;user lassen sich auch besser verteidigen.
</P>
<P ALIGN=justify><FONT COLOR="GREEN">Gr&uuml;n</FONT>/Soldat - Soldaten dienen dazu H&auml;user zu besch&uuml;tzen und stellen im
Haus Munition her. Soldaten greifen ausserdem die gegnerischen Baldies an
und vernichten sie.</P>

<P ALIGN=justify><FONT COLOR="WHITE">Weiss</FONT>/Wissenschaftler - Diese Sorte Baldies erfinden neue Waffen, Werkzeuge,
Transportsysteme usw. Halt alles um die Gegner zu vernichten.</P>

<P ALIGN=justify>Die Grafik ist recht ordentlich gelungen, nur die Musik ist etwas schw&auml;cher
ausgefallen bei einem CD-Spiel kann man schliesslich verlangen, dass die
Programmierer die Musik direkt von der CD abspielen (Red Book-Audio).
Der einzige Audio-Track auf der CD wird w&auml;hrend des wirklich witzigen
CinePak-Vorspann abgespielt, wobei der sich aber anh&ouml;rt, als h&auml;tte ihn
jemand &uuml;ber Nacht mal schnell "zusammengeschustert" weil man keine andere
Audio-Musikst&uuml;cke mehr zu Verf&uuml;gung hatte.</P>

<TABLE><TR><TH VALIGN=top>Fazit:</TH> <TD>Wer schon Spiele wie Populous, Powermonger, Siedler oder MegaLoMania
       liebt, der sollte sich Baldies kaufen. Leider hat die Jag-Version
       gegen&uuml;ber der bald erscheinen PC-Versionen keine Multi-Player-
       Unterst&uuml;tzung. Ausserdem haben die Programmierer in aller letzter
       Minute !!!alle!!! Cheats aus dem Spiel entfernt, da wenn man mit
       diesem Cheat gespielt h&auml;tte, das Spiel abgest&uuml;rzt w&auml;re...
       Einfach unglaublich, aber wahr!</TD></TR></TABLE>

<P>
<TABLE ALIGN=center BORDER><TR><TH>Grafik</TH> <TD>75 %</TD></TR>
<TR><TH>Sound</TH>  <TD>65 %</TD></TR>
<TR><TH>Gesamt</TH> <TD>80 %</TD></TR></TABLE>


<HR>
</BODY>

</HTML>