<HTML>

<HEAD>
<!-- erstellt: 04.06.1996 10:39:55 -->
<TITLE>NBA Jam TE</TITLE>
</HEAD>

<BODY>
<H1>NBA Jam TE</H1>
<HR>
<H3>NBA Jam TE - Basketball der Extraklasse!</H3>

<P ALIGN=justify>In Sachen Sportspiele wird der Jaguarbesitzer nicht vernachl&auml;ssigt, vom
Skifahren (Val D'Isere), &uuml;ber Football (Troy Aikman), Fussball (Sensible
Soccer & Fever Pitch) bis zu diversen Motorsportspielen wurde man bisher
gut versorgt. Auch ein Basketballspiel gab es schon (White Man Can"t Jump),
dass jedoch nicht so ganz &uuml;berzeugen konnte. Einziger Lichtblick war der
&uuml;ber den dem Spiel beigelegten Adapter (Team Tap) ermoeglichte
4-Spielermodus. Die Verkaufszahlen von WCJ d&uuml;rften jetzt in die H&ouml;he
schnellen, nicht jedoch wegen dem Spiel, sondern wegen dem TeamTap:</P>

<P ALIGN=justify>Ein neues Basketballspiel ist n&auml;mlich da, dass den Team Tap und damit 4
Spieler gleichzeitig unterst&uuml;tzt. Und im Gegensatz zu WCJ liegt hier kein
Team Tap bei. Daf&uuml;r ist jedoch das Spiel, dass schon mal vorab, erste,
halt, aller(!) erste Sahne!</P>

<P ALIGN=justify>Schon am Automaten in der Spielhalle hat mir das actionreiche "Two-On-Two"
Basketballspiel gefallen. Colle Animationen und schnelles unkompliziertes
Spiel, das einfach Spass macht. Am Jaguar gibt es nun die stark erweiterte
TE (Tournament Edition) Version, die wesentlich mehr Features verspricht.
Hmm, sie kennen den Automaten nicht? Naja, dann alles von vorne:</P>

<P ALIGN=justify>In NBA Jam hat jedes Team nur 2 Spieler auf dem Feld. Dabei kann je ein
Spieler fest vom Computer gesteuert werden. Wer will kann das auch unter-
binden und zwischen den beiden Spieler hin und herschalten.<BR>
Die Steurung ist simpel. Bei eigenem Ballbesitz (also im Angriff) kann man
mit C P&auml;sse spielen, mit A auf dem Korb werfen. Dr&uuml;ckt man zus&auml;tzlich
den B Knopf (Turbo), dann l&auml;uft man schneller, macht spektakul&auml;re Dunks,
falls man in der N&auml;he des Korbs ist, oder schnellere P&auml;sse.<BR>
Kurzes Antippen von A t&auml;uscht einen Korbwurf nur an, ein schneller
"Doppelklick" auf den Turbobutton sichert den Ball.<BR>
In der Abwehr (Gegner ist im Ballbesitz) &auml;ndert sich die Belegung. Da kann
man nun mit A springen um B&auml;lle runterzufangen oder mit C versuchen dem
Gegner den Ball abzujagen und weiteres mehr. Die Stuerung ist perfekt und
genau. Wer will kann jedoch die Tastenbelegungen fast beliebig ver&auml;ndern.
Der neue Pro Controller wird "nat&uuml;rlich" auch unterst&uuml;tzt!<BR>
Wer glaubt die Steuerung sei zu kompliziert der irrt, nat&uuml;rlich ist etwas
Uebung n&ouml;tig, aber bei welchem Sportspiel ist das nicht so. Um die Lernphase
zu erleichtern wurde sogar noch ein Practice Modus eingebaut. In dem man
seelenruhig Korbw&uuml;rfe, P&auml;sse etc. mit jeder beliebigen Mannschaft bzw.
Spieler &uuml;ben kann.</P>

<P ALIGN=justify>Das Spiel beachtet auch einige der wichtigsten Basketballregeln (Fouls werden
nicht geahndet, das macht aber nichts...), der Ball muss innerhalb einer
bestimmten Zeit (im Tournament Modus 24 Sekunden, sonst frei einstellbar)
auf den Korb geworfen werden ansonsten bekommt der Gegner den Ball. 5 Sekunden
davor wird jedoch ein Timer eingeblendet und Warnt&ouml;ne sind zu h&ouml;ren, damit
man es ja nicht vergisst. Ein weiterer Regelverstoss ist das Herunterfangen
des Balles wenn er sich bei einem Korbwurf des Gegners im Sinkflug befindet.
Das wird mit 2 bzw. 3 Punkte, wenn der Wurf aus der Dreierdistanz gemacht
wurde, bestraft. Nach dem der Ball jedoch den Ring oder das Board ber&uuml;hrt
hat ist es erlaubt (Rebound).</P>

<P ALIGN=justify>Das Spiel geht jeweils &uuml;ber 4 Viertel, die je 3 Minuten dauern (Tournament
Mode, ansonsten kann man die Uhr auch langsamer oder schneller einstellen).
Nach jedem Viertel kann man Spieler auswechseln und deren Positionen ver-
&auml;ndern. In jedem Team stehen dazu mindestens 3 Spieler zur Verf&uuml;gung.
Dabei bekommt man ein Spielerfoto und die St&auml;rken/Schw&auml;chen der Akteuere
angezeigt, was ziemlich wichtig ist, den der vom Computer gesteuerte Mit-
spieler handelt nach diesen Werten. Nat&uuml;rlich ist Detlef Schrempf von den
Seattle SuperSonics und alle anderen NBA Superstars dabei! Da das Spiel von
der NBA Lizensiert wurde, sind 27 Originalmanschaften der NBA mit Teamlogos
mit Orginalspielern von der Partie!</P>

<P ALIGN=justify>Insgesamt wurden 120 verschiedene Spieler + einiger Geheimspieler (die man
&uuml;ber Cheats aktivieren kann) eingebaut. Um sie auch w&auml;hrend des Spiels er-
kennen zu k&ouml;nnen, sind die K&ouml;pfe gegen&uuml;ber dem K&ouml;rper etwas gr&ouml;sser
gemacht worden. Das sieht auch nicht schlecht aus, weil man dadurch wirklich
die einzelnen Spieler dadurch wirklich erkennen und gut unterscheiden kann.</P>

<P ALIGN=justify>Das Spiel kann wie zu Beginn schon angesprochen mit bis zu vier Spieler
gespielt werden. Dabei ist auch der Computer als Spieler ein ernstzunehmender
Gegner, somit macht das Spiel auch alleine einen Heiden-Spass. Damit man
nicht gleich am Anfang den Kopf h&auml;ngen lassen muss kann man den Schwierig-
keitsgrad einstellen. Will man zu Zweit spielen, kann man entweder als Team
gegen den Computer oder gegeneinander antreten. Zu dritt oder viert spielen
immer zwei bzw. einer in einem Team.</P>

<P ALIGN=justify>Ist man im Tournament Modus, ist das Ziel des Spiels gegen alle 27 NBA Teams
zu gewinnen um dann im grossen Endspiel gegen ein Allstar-Team anzutreten.
Um das nat&uuml;rlich nicht an einem Abend schaffen zu m&uuml;ssen k&ouml;nnen Spiel-
st&auml;nde abgespeichert werden. 12 Speicherpl&auml;tze sind daf&uuml;r vorgesehen.
In einem eigenen Menue kann man auch Eintr&auml;ge einzeln wieder l&ouml;schen.
Zus&auml;tzlich werden auch noch diverse Rekorde und alle Spieleinstellungen
abgespeichert.</P>

<P ALIGN=justify>Die M&ouml;glichkeiten im Einstellungsmenue sind auch ein grosser Pluspunkt,
hier kann fast alles ver&auml;ndert werden. Dadurch macht das Spiel sicher sehr
lange Spass und ist sehr abwechslungsreich. Ist man nicht im Tournament
Modus kann man die Uhr schneller oder langsamer laufen lassen, PowerUps
(werden sie von einem Spieler eingesammelt hat er f&uuml;r kurze Zeit spezielle
F&auml;higkeiten: Super-Dunks etc.) oder Hot Spots (Man bekomm mehr Punkte wenn
man von diesen Feldern aus wirft) einschalten oder in den Juice Mode gehen.
Im Juice Modus wird das komplette Spiel beschleunigt. Juice Mode 4 ist der
helle Wahnsinn!</P>

<P ALIGN=justify>W&auml;hrend des Spiels bekommt man Tips vom "virtuellen Coach", hier kann man
auch mal lesen das man Cheats (f&uuml;r spezielle Dunks etc.) aktivieren kann.
Wie das genau geht hab ich noch nicht rausgefunden, aber wie man so h&ouml;rt
soll es in dem Game einiges an versteckten Sachen geben (z.B. ein Spiel
gegen die Tramiels!)
</P>
<P ALIGN=justify>Wie sieht das Game technisch aus?? Ich frage mich immer noch wie man soviel
Grafik, Animation und Sound auf das Modul bringen kann:</P>

<P ALIGN=justify>Von jedem Spieler ist ein kleines Foto dabei und auch noch der Kopf f&uuml;r die
Spielfigur die aus allen Ansichten gesehen werden kann. Dabei auch noch die
hervorgande Animation und die zig verschiedenen P&auml;sse (hinter dem K&ouml;rper,
vor dem K&ouml;rper), Dunks und Korbw&uuml;rfe. Das Spielfeld und die Arena, man
sieht auch die Zuschauer und Offiziellen, sind auch super in Szene gesetzt.
Der Parket scrollt perspektivisch, die Korbanlagen werden perspektivisch mit-
gedreht, die Spieler vergr&ouml;ssert/verkleinert sich je nach dem wo sie im
Feld stehen, Schatteneffekte des Balls und der Spieler, die Zuschauer und
Chearleaders im Hintergrund die auch animiert sind (Jubeln und machen
"Die Welle" wenn es heiss hergeht) scrollen in vier zus&auml;tzlichen Parallax-
ebenen, animierte Zuschauer hinter den K&ouml;rben. Und das alles absolut
fl&uuml;ssig (50/60FPS), &uuml;berhaupt kein Ruckeln. Es wurde auf soviele Details
Wert gelegt: Der Ball wird auch im Flug animiert. Bei jedem Spiel gibt es
unterschiedliche Bandenwerbung, die Bande und Zuschauer spiegeln sich im
Parket, je nach Spielort hat der Hallenboden eine andere Farbe, brennenden
K&ouml;rbe etc... Hat ein Spieler drei K&ouml;rbe in ununterbrochener Reihenfolge
(auch der Gegner darf keinen Korb machen!) versenkt, ist er im "Hot-Modus"
und der Ball wird zu einer brennenden Feuerkugel wenn er von diesem Spieler
gespielt wird, auch dies ist ein sch&ouml;ner Effekt. Das Flugverhalten des Balles
ist absolut real, was nat&uuml;rlich ein noch bessere Spielgef&uuml;hl r&uuml;berbringt.
Auch das drumherum im Spiel, die Auswahlmenues etc. wurden sehr sch&ouml;n
aufgemacht.</P>

<P ALIGN=justify>Sehr gut gelungen sind auch die Soundeffekte: Extrem viel Sprachausgabe.
Zwei Komentatoren geben w&auml;hren des Spiels coole Spr&uuml;che ab, da bei wird
jeder einzelene Spieler beim Namen genannt. Am Anfang wird auch die Spiel-
paarung per Sprachausgabe angesagt und noch dazu gibt es massig Effekte,
wie Ballger&auml;usche, Zuschauerjubel, Signalhorn, etc. Wie passt das nur alles
auf das Modul??? Naja, kann uns ja eigentlich egal sein...</P>

<P ALIGN=justify>Die Musik ist auch nicht schlecht, sie spielt auch w&auml;hrend des Spiels, kann
aber abgedreht werden.</P>

<P>Selten war ich von einem Spiel so &uuml;berzeugt wie von NBA Jam TE.</P>
<P>Die Umsetzung die uns High Voltage Software bietet ist genial.</P>
<P ALIGN=justify>Trotz eingeschr&auml;nkter Kapazit&auml;t des Moduls ist es ein Ohren- und Augen-
schmaus. Spielerisch ist es fast noch besser! Ich habe auch sicher noch "ne
Menge an Features vergessen, ich muss jetzt aber Schluss machen ich will ja
weiterspielen! Wer auf Sportspiele und Basketball steht, kann es ungesehen
kaufen. Alle anderen: unbedingt mal antesten. Ein Spiel f&uuml;r die ewige
Jaguar Besten-Liste das wahrscheinlich alle Jaguarbesitzer begeistern wird!</P>

<TABLE ALIGN=center BORDER><TR><TH>Grafik</TH> <TD>90 %</TD></TR>
<TR><TH>Sound</TH>  <TD>80 %</TD></TR>
<TR><TH>Gesamt</TH> <TD>95 %</TD></TR></TABLE>



<HR>

</BODY>

</HTML>*Æ)€BÂ˜¾#