<HTML>

<HEAD>
<!-- erstellt: 06.05.1996 12:33:08 -->
<TITLE>Rayman</TITLE>
</HEAD>

<BODY>
<H1>Rayman</H1>
<HR>
<H3>Edles Next Generation-Jump'n'Run!</H3>
<P>
Nach einigen Verz&ouml;gerungen (war Sony im Spiel?) erschien Mitte September
nun endlich die Jaguar-Version von Rayman auf Modul, das Spiel bietet
atmenberaubende High-Color-Grafik (65000 Farben)
<P>
Rayman hat die Aufgabe seine Freunde aus den K&auml;figen zu befreien und mu&szlig;
zum Schlu&szlig; (wenn er alle befreit hat) gegen Mr. Dark, dem gro&szlig;en Oberb&ouml;sewicht k&auml;mpfen. Die Grafik kann als Referenz f&uuml;r die kommenden Jaguar-Spiele
genommen werden, Rayman bewegt sich fl&uuml;ssig &uuml;ber den Screen. Es wird in
mehreren Ebenen gescrollt, nat&uuml;rlich ruckelt es ab und zu ein wenig, aber
wenn sollte das st&ouml;ren? (au&szlig;er vielleicht einen Fritz Schober)
<P>
Die Musik passt ganz gut zum Spiel, sie ist zwar leider etwas d&uuml;delig, aber
da hatten die Programmierer wohl kaum noch Platz auf dem Modul wegen der
wahnsinnig guten Grafik. Spielerisch l&auml;&szlig;t sich auch nicht viel auszusetzen,
Rayman erlernt nach und nach immer mehr F&auml;higkeiten, wenn er die Fee trifft
(wie z.B. schlagen, rumh&auml;ngen, hangeln, fliegen usw.).
<P>
Nur der Schwierigkeitsgrad ist viel zu hoch angesetzt nachdem der Moskito
besiegt wurde steigt der Schwierigkeitsgrad ins Unerme&szlig;liche, ich frage mich
was sich Spieledesigner dabei gedacht haben, vor allem weil das Spiel ja
f&uuml;r Kinder und Jugendliche konzipiert wurde und nicht f&uuml;r Jump'n'Run-
Halbg&ouml;tter. So kann es schon vorkommen, da&szlig; man stundenlang ein Level spielt
bis man wieder abspeichern kann was schon sehr frustierend seien kann.
Wegen diese hohen Schwierigkeitsgrades habe ich auch noch 5% von der Gesamtwertung abgezogen, denn das Spiel mu&szlig;te auf keinen Fall so schwer sein...
<P>
<TABLE border align=center width=50>
<TR>
<TH>Grafik<TD align=center>95 %
<TR>
<TH>Sound<TD align=center>75 %
<TR>
<TH>Gesamt<TD align=center>90 %
</TABLE>

<HR>
</BODY>

</HTML>
