<HTML>

<HEAD>
<TITLE>ALIEN VS PREDATOR</TITLE>
</HEAD>

<BODY>
<H1>ALIEN VS PREDATOR</H1>
<HR>

<H2>Cheats</H2>
<HR NOSHADE>
<H3>Hold that Fuji & Banana stops</H3>

Die Cheats w&auml;hrend des Spiels eingeben.
<P> 
<TABLE BORDER WIDTH=100%>
    <TR><TH rowspan=9>"Hold that Fuji!"</TH>
         <TH>Aktivieren</TH>

      
             <TD align=center  colspan=3 width=50%>(Pause + Option)<BR> + <BR>(1+3, 2+5+7+9)</TD>  <TD align=center >Predator lacht zur Best&auml;tigung</TD></TR>
      

   
         <TR><TH rowspan=8>Befehle</TH> 
        
           <TD align=center  rowspan=2>Security Card</TD>   <TD align=center >+1</TD><TD align=center >Option+6</TD></TR> <TR><TD align=center >-1</TD><TD align=center >Option+9</TD></TR>
           <TR><TD align=center >Motion Tracker</TD>  <TD align=center  colspan=2>Option+8</TD></TR>
           <TR><TD align=center >alle Waffen aufladen</TD> <TD align=center  colspan=2>Option+1+2+3+4</TD></TR>
           <TR><TD align=center >Shotgun</TD>       <TD align=center  colspan=2>Option+1</TD></TR>
           <TR><TD align=center >Pulse Rifle</TD>  <TD align=center  colspan=2>Option+2</TD></TR>
           <TR><TD align=center >Flame Thrower</TD>  <TD align=center  colspan=2>Option+3</TD></TR>
           <TR><TD align=center >Smart Gun</TD>  <TD align=center  colspan=2>Option+4</TD></TR>
        
      

    <TR><TH rowspan=12>"Banana Stops"</TH>
         <TH>Aktivieren</TH> 
            <TD colspan=3><OL><LI>Pause,Option,6,1+3 
                    <LI>B,A,9,A,9,A 
                    <LI>*,Option,6 
                    <LI>#,*       
                    <LI>*,Option   
                    <LI>2,Option</OL></TD>             <TD align=center >Predator lacht zur Best&auml;tigung</TD></TR>
         

        
          <TR><TH rowspan=11>Befehle</TH>

           <TD align=center  rowspan=2>Security Card</TD>   <TD align=center >+1</TD><TD align=center >Option+6</TD></TR><TR>  <TD align=center >-1</TD><TD align=center >Option+9</TD></TR>
           <TR><TD align=center  colspan=2>Motion Tracker</TD>  <TD align=center >Option+8</TD></TR>
           <TR><TD align=center  colspan=2>alle Waffen aufladen</TD> <TD align=center >Option+1+2+3+4</TD></TR>
           <TR><TD align=center  colspan=2>Shotgun</TD>       <TD align=center >Option+1</TD></TR>
           <TR><TD align=center  colspan=2>Pulse Rifle</TD>  <TD align=center >Option+2</TD></TR>
           <TR><TD align=center  colspan=2>Flame Thrower</TD>  <TD align=center >Option+3</TD></TR>
           <TR><TD align=center  colspan=2>Smart Gun</TD>  <TD align=center >Option+4</TD> </TR>
            
           <TR><TD align=center  rowspan=2>Level</TD> <TD align=center >+1</TD><TD align=center >Option+A</TD><TD align=center  rowspan=2>5,4,3,2,1, Predator Schiff, Alien Schiff, Luftsch&auml;chte</TD></TR><TR> <TD align=center >-1</TD><TD align=center >Option+B</TD> 
                                </TR>
           <TR><TD align=center >Gott Modus</TD> <TD align=center  colspan=2>Option+5</TD>
                 <TD align=center >Unbesiegbar. Waffen haben unendlich Munition, dazu muﬂ aber schon Munition vorhanden sein.</TD> </TR>
</TABLE>            
<P><HR NOSHADE>        
<H3>Alien Queen einfrieren</H3>
 <P>In der Eierkammer Spiel speichern und dann wieder laden. Die Queen ist jetzt eingefroren und kann bearbeitet werden. 
 Geht man jetzt durcj den Eingang, stirbt sie.</P>
<P><HR NOSHADE>
<H3>Unsichtbare Predators erschiessen</H3>
 <P>Bevor man im Predator Schiff die smartgun aufnimmt, schie&szlig;t man mit der pulse rifle oder
 der shotgun um sich oder wenn man's wi&szlig, dorthin wo die Predators normalerweise erscheinen, wenn man sich
 die smartgun holt. Man sieht dann das Blut, und wenn man genug Munition verballert hat, werden die Predators
 sterben, sobald man die smartgun aufnimmt.</P>
<P><HR>
<H2>Tips</H2>
<HR NOSHADE>      
<H3>Marine:</H3>

<P ALIGN=justify>Karte 2, 3, 4, 6, 8 wird nicht ben&ouml;tigt zur L&ouml;sung des Spiels !!!! (gemein)</P>

<P ALIGN=justify>In Level 3 (der Startlevel) gibt es einen Luftschacht mit der Bezeichnung 3C
es gibt nur einen Ausgang dort findest du dann die Pulse Rifel. Der Luftschacht
m&uuml;&szlig;te am Ende der Cantine liegen dort kommt man in eine wei&szlig;en Raum von dort in
den n&auml;chsten und dort dann in den Luftschacht.</P>

<P ALIGN=justify>Die Sicherheitskarte 5 und den Motion Tracker findet man in Level 5. Aber man
braucht die Pulse Rifel sonst kann man die Predators nicht besiegen.
Der Motion-Tracker ist ganz leicht zu finden einfach runter mit den Aufzug
mit dem man alle 5 Etagen erreichen kann in Level 5 dann links und die
n&auml;chste T&uuml;r ist eine kleine Kammer wo der Tracker ist.</P>

<P ALIGN=justify>Nun f&auml;hrt man in den Aufzug in Level 4 und sucht den L&uuml;ftungsschacht 4C,
der schlie&szlig;lich in die Medical-Abteilung f&uuml;hrt - dort findet man Karte 6 !!</P>

<P ALIGN=justify>Danach geht es nach Level 1 (Vorsicht viele Aliens) wo wir uns die gro&szlig;e
Halle freischiessen und in einen der kleinen R&auml;ume in der gro&szlig;en Halle
Karte 7 finden. Mit dieser Karte k&ouml;nnen wir nach Level 4 fahren und
holen uns aus der Waffenabteilung den Flammenwerfer.</P>

<P ALIGN=justify>Und schon wieder geht es nach Level 1, wo wir aber auch den anderen Aufzug nehmen k&ouml;nnen. Von Level 3 sind beide Aufz&uuml;ge sehr gut zu erreichen !!</P>

<P ALIGN=justify>Dort suchen wir die Airlocks - die meisten R&auml;ume in Level 1 sind nur
mit Aliens gef&uuml;llt und haben KEINE Extras bzw. Nahrung.</P>

<P ALIGN=justify>Nun sind wir im Predator-Raumschiff wo sich min. 6 Predators rumtreiben.
Den ersten haben wir zum Airlock gelockt und wenn er noch von der T&uuml;r
ein St&uuml;ck entfernt ist und auf uns eine "blaue Kugel" schie&szlig;t, dann
schliessen wir die T&uuml;r der Predator rennt dem Schu&szlig; nach und der Schu&szlig;
"explodiert" vor der T&uuml;r und der dumme Predator bekommt was mit und ist
tot. Die anderen Predators sollte man auch zur T&uuml;r locken oder mit den
Flammenwerfer auf Distanz bek&auml;mpfen.
Als Erstes finden wir im Predator-Ship die Karte 9 und ein wenig sp&auml;ter
die Smart Gun mit der wir Predator nach 1 Sekunde unter Beschu&szlig; t&ouml;ten
k&ouml;nnen. Vorsicht !!! Wir sind auf einmal von 3 Predators umgeben, wenn
sie unsichtbar sind sollte man nach den Motion Tracker gehen und sie
gnadenlos ins Jenseits schicken.</P>

<P ALIGN=justify>Nun brauchen wir nur noch ins Alien-Ship und die Karte Numero 10 holen :-)
Ins Alien-Schiff kommt man entweder mit den Aufzug der alle 5 Etagen anfahren kann und dann &uuml;ber Luftschacht 5C, oder wie der PREDATOR es machen
mu&szlig; &uuml;ber Level 4 mit in Aufzug der in der N&auml;he der Medical-Abteilung ist.
Diese Karte wird nat&uuml;rlich von der Alien-Queen bewacht. Das Alien-Schiff
ist riesig aber man findet immer wieder genug Munition und Medical-Kits
von den gescheiterten Genossen. Die Alien-Queen ist in einen Raum mit
"schwarzer" Decke mit ca. 15-20 Eier die ausschl&uuml;pfen wenn man sich ihnen
n&auml;hert. Die Queen kann aber nicht den Raum verlassen und so kann man reingehen mit der Smart-Gun ballern und schnell wieder den Raum verlassen
bevor die Queen dich angreifen kann. Dies wiederholt man seeehhhrr offtt !!
Danach killt man die Eier (noch genug Munition ??? :-)) nimmt die Karte
Nr. 10, aber was ist das ??? Man verl&auml;&szlig;t schnell den Raum und brauch
nur noch in Level 2 den Selbstzerst&ouml;rungsmechanismus zu aktivieren dann
hat man nur noch sehr knappe 2 Minuten die Rettungskapsel zu finden, die
in Level 5 ist ganz in der N&auml;he des Aufzuges bei einen weiteren Airlock.</P>
<P><HR NOSHADE>
<H3>Predator</H3>


<P ALIGN=justify>In Level 3 ist genug Nahrung - in diesen Raum sollte man speichern.
Viele Marines und Aliens killen und wieder in diesen Raum abspeichern,
den Spielstand laden - Energie auftanken und dann wieder killen usw. usw.
bis man ALLE WAFFEN hat.</P>
<P>Nun braucht man nur noch ins Alien-Schiff, aber der Predator hat kein
Bock durch die Luftsch&auml;chte zu kriechen so mu&szlig; man leider &uuml;ber den
zweiten Aufzug in Level 4 - Nahe der Medical-Abteilung in Level 5 fahren
und nur noch den Eingang ins Alien-Ship suchen. </P>

<P><HR NOSHADE>
<H3>Allgemeine Tips</H3>

<P ALIGN=justify>In Level 3 kann man immer Nahrung und Waffen auftanken, sowie in Level 4
in der Waffenabteilung gibt es Munition. Ab und zu mu&szlig; diese Levels
aufsuchen um wieder aufzutanken, da Level 1 unm&ouml;glich ohne "auftanken"
durchspielbar ist !!</P>




<HR>
</BODY>

</HTML>
