<HTML>

<HEAD>

<TITLE>HIGHLANDER - THE LAST OF THE MACLEODS</TITLE>
</HEAD>

<BODY>
<H1>HIGHLANDER - THE LAST OF THE MACLEODS</H1>

<HR>

<H2>L&ouml;sungsweg :</H2>

<H3>1. Abschnitt</H3>


<P ALIGN=justify>Die erste Wache besiegt man am besten mit den C-Knopf Tritt, wenn sie
auf unseren Helden zugeht. Die zweite Wache am hinteren Tor kann man
auf die selbe Art beseitigen. In zwei H&uuml;tten des Dorfes sind Wachen
mit denen sollte man sich auf keinen Fall ohne Schwert anlegen.</P>
<P ALIGN=justify>Das Dorf sollte man durch das vordere Tor auf keinen Fall verlassen, da
ihr dann sofort von zwei Wachen attaktiert werdet!</P>
<P ALIGN=justify>In einer der H&uuml;tten findet man einen Holzstock, den man zwar nicht als
Waffe benutzen kann, aber dadurch l&auml;&szlig;t sich das hintere verschlossene
Tor des Dorfes &ouml;ffnen. In einen der H&uuml;tten ist auch noch eine verschlossene
Truhe doch wie diese ge&ouml;ffnet werden kann ist mir leider unbekannt.</P>
<P ALIGN=justify>Das Schmuckst&uuml;ck sollte man auf jeden Fall mitnehmen bzw. untersuchen und
es wird dann eine Cinepak-Sequenz abgespielt, worin die sterbene Mutter dem
Spielhelden die Aufgabe stellt seine kleine Schwester zu befreien und den
Oberb&ouml;sewicht zu besiegen.</P>

<P ALIGN=justify>Jetzt k&ouml;nnen wir das Dorf durch das hintere Tor verlassen und gehen zum Berg,
dort erwartet uns der Unsterbliche Ramirez und wir erhalten das Schwert der
MacLeods. Wir gehen nun den Weg zur&uuml;ck und gehen nicht mehr ins Dorf, sondern
in Richtung der Schlucht. Dort m&uuml;ssen drei W&auml;chter nacheinander besiegt
werden, als Schlagvariante mit den Schwert ist vorne und C-Knopf recht
erfolgreich, aber jeder sollte die beste Technik ausprobieren...</P>

<P ALIGN=justify>Nun kommt ihr vor dem Tor des Dorfes, lauft nicht so weit vor, sonst
kommen beide Wachen angerannt, geht Schritt f&uuml;r Schritt dann k&ouml;nnt ihr
die Wachen hintereinander ohne Probleme beseitigen.</P>

<P ALIGN=justify>Als n&auml;chstes gehen wir zu den Teich und untersuchen das Wasserrad, daraufhin
sehen wir eine weitere Cinepak-Sequenz. Ganz in der n&auml;he werdet ihr auch eine
Holzplanke finden, die ihr f&uuml;r unwichtig haltet, aber ihr solltet sie auf
jeden Fall mitnehmen, da sie im zweiten Abschnitt ben&ouml;tigt wird!!</P>

<P ALIGN=justify>Nachdem wir die Wache bei den Panzer besiegt haben gelangen wir in den zweiten
Abschnitt, hoffentlich habt ihr noch genug Nahrungs-Reserven!!!</P>


<H3>2. Abschnitt</H3>


<P ALIGN=justify>Ihr befindet euch in einem Tal, hinter euch ist nur W&uuml;ste. Die W&auml;chter
hier sind anscheinend wesentlich st&auml;rker als im 1. Abschnitt, also k&auml;mpft
so gut wie ihr k&ouml;nnt, da ihr in diesen Abschnitt kaum Nahrung findet.</P>

<P ALIGN=justify>Nun k&ouml;nnt ihr recht eine Treppe raufgehen, aber die Holzstege haben eine
L&uuml;cke, fallt ihr in diese werdet ihr Opfer des darunter liegenden Treib-
sandes, deshalb solltet ihr die Holzplanke benutzen und der Weg ist frei!</P>

<P ALIGN=justify>Einige Treppen h&ouml;her erwarten euch zwei W&auml;chter, da ihr meist aus dem Bild
gedr&auml;ngt werdet ist folgende Taktik empfehlenswert: In dem Bereich mit den
Gegner reingegen, das CD-ROM-Laufwerk l&auml;d, C+Knopf gedr&uuml;ckt halten...
Die Gegner werden meist getroffen und ihr verschwindet aus den Bereich, ohne
unn&ouml;tige Lebensenergie zu verlieren. Dies macht wiederholt ihr so oft, bis
die Gegner besiegt sind.</P>

<P ALIGN=justify>Danach geht es in einer H&ouml;lle, wo wieder zwei Gegner sind, dort ist irgendein
Raum mit einer Maschine mit der ich nichts anfangen kann, ich finde dann
zwar noch eine Kurbel, aber die kann ich nirgendwo benutzen und leider bin
ich bei der weiteren Erforschung das Tals gestorben, da ich keine Nahrung
mehr hatte um meine Energie aufzuf&uuml;llen... :(</P>
<HR>
<H2>Hinweis :</H2>
<P ALIGN=justify>Nebenbei bemerkt ist das ProController-Pad von Atari auch sehr n&uuml;tzlich,
da Knopf X und Y f&uuml;r Ausweichspr&uuml;nge nach links und rechts stehen und Z bewirkt einen
 schnellen Sprung nach hinten um Attacken der Gegner auszuweichen.</P>
<HR><H2>Cheats:</H2>
  
       <UL>
       <LI>  Get the Chicken God and activate the Teleport:<BR>
             Place the flower in the vase in the Temple of the Chicken God
             hidden in the canyon behind the large tall rock with the
             sniper on top.</UL>
<P>
<HR>
</BODY>

</HTML>
