<HTML>

<HEAD>
<!-- erstellt: 06.05.1996 09:20:38 -->
<TITLE>Battlemorph</TITLE>
</HEAD>

<BODY>
<H1>Battlemorph</H1>
<HR>
<P>
Endlich ist er da! Der Nachfolger zum ersten Jaguar Spiel (Cybermorph)
&uuml;berhaupt. Bei Battlemorph haben die Programmierer von "Attention To
Detail" in allen Bereichen das Spiel aufpoliert und machen auch regen
Gebrauch von den neuen M&ouml;glichkeiten der CD.
<P>
<H3>Grafik:</H3>
<P>
Es gibt es eine Reihe von gelungenen Full-Screen-Video Sequenzen (der
Sprecher mit dem schottischen Akzent ist super!) zu Beginn und w&auml;hrend des
Spiels. Die Grafik im Spiel selbst besteht, &auml;hnlich wie beim Vorg&auml;nger, zum
gro&szlig;en Teil Gouraud geshadeten Polygonen. Es wurden allerdings eine Reihe
von neuen Geb&auml;uden und Gegnern hinzugef&uuml;gt, bei denen sehr viel Textur-
Mapping eingesetzt wird. Neu ist auch die M&ouml;glichkeit in das Wasser
einzutauchen oder durch R&ouml;hren in unterirdische R&auml;ume zu fliegen. Der
Unterwassereffekt ist sehenswert und die komplett mit Texturen &uuml;berzogene
unterirdische Welt mu&szlig; sich nicht hinter anderen Vertretern dieses Generes
verstecken. Abgerundet wird der positive Gesamteindruck durch ansehnliche
Hintergrundgrafiken. Die Framerate hat erfreulicherweise durch die ganzen
Verbesserungen nicht gelitten. Etwas st&ouml;rend ist allerdings, da&szlig; die
Berechnungstiefe der Grafik nicht sehr hoch ist, und dadurch die
Landschaft relativ pl&ouml;tzlich aus den Nichts auftaucht.
<P>
<H3>Sound:</H3>
<P>
Die Soundeffekte wurden weitgehend aus Cybermorph &uuml;bernommen, und die
Anweisungen des Computers sind vielf&auml;ltiger und bei weitem nicht so nervig
wie fr&uuml;her. Neu ist auch die Ingame-Musik, die direkt von der CD abgespielt
wird. Die Soundtracks im Stile von 'Tangerine Dream' sind ein Ohrenschmaus
und nie st&ouml;rend, eher im Gegenteil: Man vergisst die Umwelt! Nett ist auch
die Idee, die Musik je nachdem wo man sich gerade befindet (Luft, Wasser,
unterirdisch) zu wechseln.
<P>
<H3>Spielspa&szlig;:</H3>
<P>
Hier ist der gr&ouml;&szlig;te Zuwachs zu verbuchen. Durch verschiedene Auftr&auml;ge,
Adventureelemente und neuen Gegnern ist der Spielwitz durchweg hoch. Auch
durch die M&ouml;glichkeit unter Wasser und unterirdisch die Puzzles zu
l&ouml;sen ist Battlemorph abwechlungsreicher als sein Vorg&auml;nger.
Die Steuerung ist vorbildlich und vermiest einem den Spielespa&szlig; nicht.
<P>
<H3>Fazit:</H3>
<P>
Das erste wirklich gelungene CD Spiel f&uuml;r den Jaguar.
(Anmerk. der Redaktion: neben Highlander)
<P>
<TABLE align=center border width=50>
<TR>
<TH>Grafik<TD align=center>7
<TR>
<TH>Sound<TD align=center>8
<TR>
<TH>Spielwitz<TD align=center>9
<TR>
<TH>Gesamt<TD align=center>8+
</Table>
<P>
Ich habe mich mit Andreas Binner auf folgende Jaguar Mag-Wertung geeinigt.
(bei den oberen Zahlen kommen nur die Leute durcheinander ;))
<P>
<TABLE align=center border width=50>
<TR>
<TH>Grafik<TD align=center>75 %
<TR>
<TH>Sound<TD align=center>80 %
<TR>
<TH>Gesamt<TD align=center>85 %
</Table>

<HR>
</BODY>

</HTML>
