<HTML>

<HEAD>
<!-- erstellt: 06.05.1996 11:03:29 -->
<TITLE>Highlander - The Last of the MacLeods</TITLE>
</HEAD>

<BODY>
<H1>Highlander - The Last of the MacLeods</H1>
<HR>

<H3>Highlander oder Lowlander?</H3>
<P>
Am 1.11.1995 kam eines der besten Kaufargumente f&uuml;r Jaguar-CD ROM in den
amerikanischen Gesch&auml;ften, n&auml;mlich ein Spiel names "Highlander - The Last
of the MacLeods". Einige von euch werden sicherlich einen digitalisierten
Christopher Lamert oder den RTL-Seriefuzzi Adrian Paul erwarten, aber dies
ist falsch!!! Denn meistens kommt es anderes als man denken...
<P>
Dieses Jaguar CD-Spiel basiert auf die ausl&auml;ndische Comic-Serie von Gaumont
Television (noch nie geh&ouml;rt? Ich auch nicht). Die Handlung der Comic-Serie
wurde auf das Spiel &uuml;bertragen - keine Angst euch erwartet jetzt kein x-ter
Teil von Dragon's Lair oder so... Es werden nur ab und zu Cinepak-Sequenzen
aus der Comic-Serie verwendet um die Fortgang der Story zu veranschaulichen,
welches auch sehr gut gelungen ist. Zus&auml;tzlich gibt es auch noch ein paar
von den Programmierern gerenderte Animationssequenzen.
<P>
Nun zu der Story:
<P><Q><CITE>
Du bist Quentin MacLeod, der Letzte der (Jaguar-Besitzer, &auml;hem) Unsterblichen
 und die Hoffnung der Menschheit. Du hast Deine echte Identit&auml;t erst nach dem
 Tod Deiner Mutter und der Zerst&ouml;rung Deines Dorfes herausgefunden (dumm
 gelaufen, wie?). Als sie starb, hat Deine Mutter Dir Deine wahre Aufgabe
 offenbart ("finde den heiligen Gral" - SCHNAUZE LETHAUS! "Ok, ok") - die
 Rettung der Menschheit vor dem teuflischen Unsterblichen Kortan. Ramirez,
 einer der guten Unsterblichen, wird Dir in Deiner Aufgabe beistehen.
 ("Aber ich will doch nur singen!" - SCHNAUZE LETTHAAAUSSSSS!!!!)
 Deine erste Herausforderung ist die Rettung der &uuml;berlebenden Dorfbewohner
 (den Dundees) aus Kortans Festung. Sei wachsam oder die erste Aufgabe wird
 schnell Deine Letzte sein!
</CITE></Q>
<P>
Das Spiel beginnt damit, da&szlig; Ihr in den stark zerst&ouml;rten Heimat-Dorf euch
einige n&uuml;tzliche Objekte besorgen m&uuml;&szlig;t, dies wird durch feindliche W&auml;chter
etwas schwieriger als man denkt, da unser Held nur seine blo&szlig;en F&auml;uste und
Beine hat. Aber durch einen gezielten Tritt lassen sich die W&auml;chter leicht
ausknocken man sollte nur ein wenig šbung haben (erste L&ouml;sungshilfe siehe
Spieletips!!).
<P>
Highlander kann man mit dem PC-Megahit "Alone in the Dark" vergleichen, nur
ist die Grafik dank True Color bei Highlander wesentlich beeindruckender,
jedes der Hintergrundbilder wurde extra gerendert, dagegen wirkt eure Vektorgrafik-Figur sowie eure Gegner richtig schlicht.
<P>
Die Musik ist auch sehr gut gelungen, wie auch die zahlreichen tollen Sound-
effekte die eine tolle Atmosph&auml;re vermitteln, man f&uuml;hlt sich wie ein Teil
vom Spiel.
<P>
Die Steuerung geht einfach von der Hand und so findet man schnell ins Spiel,
was nicht bei jedem Jaguar-Spiel eine Selbstverst&auml;ndlichkeit ist. Die Story
ist absolut genial und ihr erfahrt erst nach und nach mehr Informationen
&uuml;ber den Helden, die Aufgabe und seine Familie. Die Puzzles sind bei AktionAdventuren eines der wichtigsten Elemente, leider wurde ihr etwas geschlampt.
Wenn man z.B. gegen einen Gegner mit Schwert k&auml;mpft und hat diesen besiegt,
findet man alles M&ouml;gliche, aber NICHT das Schwert. Auch gab es in den ersten
Abschnitt des Spiels zu wenig Puzzles (siehe Spieletips). Zwar habe ich es
noch nicht gel&ouml;st, wie ich die Truhe &ouml;ffnen kann, aber man findet in den
ersten Abschnitt einfach zu wenig Gegenstaende, dass die Loesung schnell
durch simples ausprobieren durchgef&uuml;hrt werden kann, anstatt ein wenig die
grauen Gehirnzellen zu benutzen. Auch wechselt f&uuml;r meinen Geschmack die
Spieleperspektive (Blickwinkel) zu oft. Durch diese Tatsachen bleibt
Highlander eine noch h&ouml;here Wertung versagt.
<P>
<TABLE>
<TR>
<TH valign=top>Fazit:
<TD>Jeder Jaguar-Besitzer sollte zugreifen allerdings ist die derzeit
       schwer verf&uuml;gbare Memory Track Card ein MUSS!! Und auch Ataris neues
       Joypad names ProController ist empfehlenswert, da es bei K&auml;mpfen
       die Ausweichman&ouml;ver (X,Y,Z-Taste) unterst&uuml;tzt.
</TABLE>
<P>
<TABLE border width=50 border align=center>
<TR>
<TH>Grafik<TD align=center>96 %
<TR>
<TH>Sound<TD align=center>90 %
<TR>
<TH>Gesamt<TD align=center>90 %
</TABLE>

<HR>
</BODY>

</HTML>
