<HTML>

<HEAD>
<!-- erstellt: 06.05.1996 11:49:43 -->
<TITLE>Pitfall - The Mayan Adventure</TITLE>
</HEAD>

<BODY>
<H1>Pitfall - The Mayan Adventure</H1>
<HR>
<P>
<H3>Gibt ein Jump'n'Run nach Rayman?</H3>
<P>
Dies fragen sich viele Jaguar-Besitzer und diese Frage kann eindeutlich mit
"JA" beantwortet werden. Mit Pitfall ist es Imagitec gelungen ein Jump'n'Run
von den 16-Bit Konsolen bzw. PC zu konvertieren, welches gegen&uuml;ber Rayman
als gleichwertig bezeichnet werden kann.
<P>
Grafisch kann Pitfall zwar nicht mit Rayman mithalten, daf&uuml;r ist aber der
Sound und das Gameplay besser. Auch ist das Spiel vom Schwierigkeitsgrad
wesentlich fairer als Rayman. Aber erstmal zu der Story des Spiels:
<P><CITE>
Pitfall Harry wurde von den gef&uuml;rchteten Kriegsgeist Zakelua, dem Gott des
 B&ouml;sen, gefangengenommen. Du, der junge Harry Junior, mu&szlig;t in das Unbekannte
 aufbrechen um deinen Vater zu retten - Du hast nur Deine altbew&auml;hrte Steinschleuder und seine Aufzeichungen dabei. Halte Ausschau nach Dingen, die
 Dir helfen Dich durch den mayanischen Dschungel zu schlagen. Bleib auf dem
 Posten! Eine falsche Bewegung und Du bist mayanischer Nachtisch!
</CITE><P>
So schlimm ist es nun auch wieder nicht, wie es die Anleitung behauptet.
Eure Held ist einer Steinschleuder, Bumerangs und Bomben bewaffnet, die
auf dem normalen Joypad per Option umgeschaltet werden k&ouml;nnen. Bei Ataris
neuen ProController k&ouml;nnen die Waffen direkt &uuml;ber die Z,Y,X-Tasten angew&auml;lt
werden, was bei kritischen Situationen (Endgegner) ein klarer Vorteil ist.
<P>
Die Steuerung der Spielfigur gestaltet sich problemlos. Die Animation ist
sehr gut gelungen und unser Held kann viele Bewegungen ausf&uuml;hren von rennen,
kriechen, schwingen von Ast zu Ast, Seil hoch/runter-klettern, Seilbahn
fahren, Bungee-Jumping, Hebel umlegen, auf den Minenwagen fahren (in den
vorletzten Level der wirklich super ist!)  und vieles mehr... Damit ist
Pitfall spielerisch wesentlich abwechselungsreicher als Rayman.
<P>
Die Grafik stammt 1:1 von der fast zeitgleich erschienen Windows '95-Version,
nur l&auml;&szlig;t sich die Jaguar-Version fl&uuml;ssiger Spielen als auf einem sehr hoch
getakteten 486 (100 MHz). Was f&uuml;r den PC nat&uuml;rlich ein Armutszeugnis ist!!!
Die Jaguar-Version l&auml;uft konstant in 30 Frames, nur leider ruckelt der
Hintergrund ganz leicht, was aber den Spielfluss in keinster Weise st&ouml;rt und
nach einigen Minuten f&auml;llt es auch nicht mehr auf.
<P>
Die Musik h&auml;lt sich im Hintergrund w&auml;hrend, die Soundeffekte wirklich toll
gelungen sind und eine richtige Urwald-Atmosph&auml;re aufbauen.
<P>
<TABLE>
<TR><TH valign=top>Fazit:
<TD>Wer Jump'n'Run liebt MUSS sich Pitfall - The Mayan Adventure kaufen,
       als kleiner Gag wurde sogar die 2600er Version im Modul versteckt.
       Eine wirklich geniale Idee!!!
</TABLE>
<P>
<TABLE align=center border width=50>
<TR>
<TH>Grafik<TD align=center>80 %
<TR>
<TH>Sound<TD align=center>75 %
<TR>
<TH>Gesamt<TD align=center>90 %
</TABLE>

<HR>
</BODY>

</HTML>
