<HTML>

<HEAD>
<!-- erstellt: 06.05.1996 12:12:15 -->
<TITLE>Power Drive Rally</TITLE>
</HEAD>

<BODY>
<H1>Power Drive Rally</H1>
<HR>
<P>
Endlich erscheint wiedermal ein Spiel eines Fremdherstellers. Gab es bei den
anderen "Third-Party"-Spielen nur oft 1:1 Umsetzung vorhandener PC oder 16-Bit
Konsolen Spiele, wird man mit Power Drive Rally freudig &uuml;berrascht. Man bekommt
ein sehr sch&ouml;n aufgemachtes und absolut fl&uuml;ssiges Rennspiel, da&szlig; noch dazu 'ne
Menge Spa&szlig; macht. Aber fangen wir von vorne an...
<P>
Das Renngeschehen in PDR wird aus der Vogelperspektive (leicht schr&auml;g)
verfolgt, dabei ist die Rennstrecke mehrere Bildschirme gro&szlig; und es wird
absolut fl&uuml;ssig (50/60Hz) teilweise in mehreren Ebenen in allen Richtungen
gescrollt. Um das Fahrzeug realistisch in die Umgebung einzuf&uuml;gen versperren
B&auml;ume, Geb&auml;ude und andere Sachen hin und wieder etwas die Sicht (Auto f&auml;hrt
dahinter vorbei) oder sie werfen Schatten auf das Auto. Dieses Grafiksystem ist
ziemlich aufwendig und setzt daher das ganze wirklich sehr gut in Szene. Das
Auto wird mit links/rechts und den drei Feuerkn&ouml;pfen gesteuert. C f&uuml;r Bremsen,
B Gasgeben und A dem wechseln zwischen Vorw&auml;rts- unddes R&uuml;ckw&auml;rtsgang. Au&szlig;er
dem Einlegen des Letzteren wird automatisch geschaltet, man braucht sich darum
nicht k&uuml;mmern. &Uuml;ber die Keypadtasten 2 kann man noch das Licht ein-/ausschalten
und &uuml;ber 3 die Hupe bet&auml;tigen. Das Licht ist bei Rennen die Nachts stattfinden
sehr wichtig (ist auch grafisch sehr sch&ouml;n gemacht, sogar beim R&uuml;ckw&auml;rtsfahren
sieht man dann einen Lichtschein), die Hupe ist aber anscheinend doch nur ein
Gag...<BR>
Die Steuerung des Spiels ist sehr gut gelungen, ein bischen Training auf den
vier Trainingsparkurs und man hat das Auto schnell unter Kontrolle. Jedes
Trainingsterain hat einen anderen Untergrund, das ist wichtig weil je nach
Untergrund sich das Fahrzeug anders verh&auml;lt. Auf etwas verschneiter Fahrbahn
kann man schon sch&ouml;n um die Kurven driften, auf Schnee und Eis kann man dann
schon fast Piruetten durchf&uuml;hren und auf Sand verh&auml;lt sich das jeweilige
Fahrzeug (es gibt 6 verschiedene (Mini Cooper S, Fiat Chinquecento Turbo, Opel
Astra 16V GTI, Renault Clio Turbo, Ford RS Cosworth und einen Toyota Celica
CT-4) wieder ganz anders. Das Fahrverhalten auf den verschiedenen
Bodenverh&auml;ltnissen wurde genial gut r&uuml;bergebracht, man sieht auch die
Reifenspuren bei Scharfen bremsen oder beim Driften im Schnee oder auf der
Stra&szlig;e. Auch das sieht sehr realistisch aus. Leider "merkt" sich das Spiel die
Reifenspuren nur f&uuml;r 1 1/2 Bildschirme, danach verschwinden sie wieder (hat
IMHO Speicherplatzgr&uuml;nde), da&szlig; kann zwar teilweise zu abgeschnittenen Spuren
f&uuml;hren ist aber nicht so schlimm.
<P>
Das eigentliche Rennen f&uuml;hrt durch eine mehrw&ouml;chige Rallymeisterschaft in
verschiedenen L&auml;ndern. Man mu&szlig; sich jedoch f&uuml;r jede Runde qualifizieren, indem
man die vorherige Strecke in einer bestimmten Zeit schaft. Hat man eine Strecke
geschaft bekommt man Preisgeld und eine zus&auml;tzliche Siegespr&auml;mie wenn man gegen
den Computergegener gewinnt. Mit diesem Geld kann man dann sein Auto nach jedem
Rennen wieder herrichten (durch diverse Karambolagen, Schlagl&ouml;cher, etc geht
schon mal was kaputt!) und man mu&szlig; das Startgeld f&uuml;r das n&auml;chste Rennen zahlen.
Kann man das nicht mehr ist das Spiel zu Ende: Game Over. Man sollte nat&uuml;rlich
mit dem Auto sogsam umgehen, damit man nicht zuviel Geld in Reperaturen stecken
mu&szlig; und so mit recht bald das n&ouml;tige Geld f&uuml;r ein besseres Auto hat.
<P>
Neben normalen Rennen alleine oder gegen den Computergegner (leider nur immer
einer...) mu&szlig; man hin und wieder auch Skilltest durchf&uuml;hren. hier mu&szlig; man durch
einen Parkurfahren, Punktgenau bremsen, r&uuml;ckw&auml;rts Einparken und man sollte
nochdazu keine H&uuml;tchen umfahren denn sost gehen gleich 10 Sekunden pro H&uuml;tchen
von der Zeit weg.
<P>
Durch die sehr detailreiche (Bremslichter und R&uuml;ckfahrlichter gehen an,
Regentropfen schlagen am Boden auf...) und liebevoll gezeichnete Grafik die mit
vielen Effekten aufwartet (sich im Wasser spiegelnde Wolken, Regen, Schneefall,
Blitz, Tunnels, Wasserf&auml;lle, etc.) und durch die tolle Steuerung macht das Game
sehr viel Spa&szlig;. Die Musik ist auch sehr gut, nervt aber w&auml;hrend des Spiels doch
etwas, man kann sie aber einfach abschalten und h&ouml;rt dann nur noch die
Soundeffekte und die Ansagen des Beifahrers. Ach ja das h&auml;tte ich fast
vergessen, man hat noch einen Beifahrer der immer die n&auml;chsten Streckenelemente
ansagt. Die Stimme ist glasklar und gut gemacht. Was am Sound etwas schwach
ist, ist das Motorger&auml;usch, das eint&ouml;nige Brummen h&ouml;rt sich nicht gerade
realistisch an. Reifenquitschen, Donner, und solche Sachen sind jedoch ganz gut
gelungen.
<P>
Jetzt aber ein kleiner D&auml;mpfer des sonst wirklich sehr guten Spiels. Es gibt
leider KEINEN simultanen Mehrspielermodus. Ein Spiel mit geteiltem Bildschirm
w&auml;re wegen der gro&szlig;en Sprites schon gar nicht m&ouml;glich, da man sonst kaum noch
was von der Strecke sehen w&uuml;rde, jedoch wurde auch keine Linkoption
implementiert. Schade, das w&auml;re der absolute Knaller gewesen.<BR>
Daf&uuml;r gibt es aber eine Weltmeisterschaft in der bis zu 8 Spielern
hintereinander spielen kann. Dabei werden dann die Einzelzeiten ausgewertet und
Punkte verteilt.
<P>

Trotz der fehlenden Linkoption ist PDR eins der besten Jaguarspiele bisher,
durch die abwechslungsreiche Grafik und gute Spielbarkeit lange motivierend.
Man kann das Spiel beruhigt empfehlen.
<P>

<B>Wertung:</B>

<TABLE border align=center width=50>
<TR>
<TH>Grafik<TD align=center>85%
<TR>
<TH>Sound<TD align=center>70%
<TR>
<TH>Motivation<TD align=center>(mit 2 Spielerlink w&auml;ren es 95% gewesen)
<TR>
<TH>Gesamt<TD align=center>(mit 2 Spielerlink w&auml;ren es 95% gewesen)
</TABLE>

<P>
(PS: Auch nicht Jaguarbesitzer die das Spiel bei mir gespielt haben sind ganz
begeistert...)


<HR>
</BODY>

</HTML>
