<HTML>

<HEAD>
<!-- erstellt: 06.05.1996 12:38:40 -->
<TITLE>Ruiner Pinball</TITLE>
</HEAD>

<BODY>
<H1>Ruiner Pinball</H1>
<HR>
<HR>
<H3>Ruin [deut.= Untergang,Ende] + er = Ruiner</H3>
<P>
Man konnte das Spiel nicht passender bezeichnen, Ruiner ist wirklich ein
verdammt schlechtes Spiel. In allen Bereichen ist Pinball Fantasies besser,
warum mu&szlig;te Atari den Kunden so ein Produkt zumuten?
<P>
Erstmal zur "tollen" Story die sich wie eine Satire liest:
<P><CITE>
Ruiner Pinball sind zwei phantastische Spiele in einem! (nur weil es zwei
 Tische hat kann man nicht gleich von zwei Spielen sprechen, dann h&auml;tte
 Pinball Fantasies n&auml;mlich vier phantastische Spiele in einem!) In Ruiner
 bietet ein doppelt breiter Flippertisch herausforderndes Spiel die echte,
 klassische Arcade-Atmosph&auml;re (die Programmierer haben wohl nie an einen
 echten Flipper-Automaten in der Spielhalle gezockt?), wobei Du Dein Land
 vor einem fremden Angriff verteidigst (der Traum jedes heldenhaften
 Amerikaners) und einen Gegenschlag vorbereitest (Ruiner - Pinball Teil 2?).<BR>
 In Tower ist der dreifach lange Flippertisch so gespenstisch (das richtige
 Wort w&auml;re "ruckelig"), da&szlig; Du glauben wirst in die H&ouml;lle herabgestiegen
 (dort sollte man auch die Programmierer dieses Machtwerkes hinschicken)
 zu sein. Die Zauberin und ihre hinterh&auml;ltigen Untergegebenen (meinen sie
 damit den Producer und die Programmierer?) sind hinter dir (dein Geld) her.
 Drei magische Spr&uuml;che bringen den Tower zum donnernden Zusammenbruch (Ich
 rate mal - Das Spiel st&uuml;rzt ab) aber kannst Du sie herausfinden, bevor es
 zu sp&auml;t ist? (Ja, es ist schon sp&auml;t und dieser Testbericht mu&szlig; endlich
 fertig werden...)</CITE>
<P>
<H4>Zur Grafik</H4>
<P>
Die Grafik ist wirklich schlecht gelungen und kann bestenfalls als Durchschnitt bezeichnet werden, selbst Obsession auf dem Atari STE hat bessere
Grafik! Die gr&ouml;&szlig;te Frechheit ist jedoch, da&szlig; das Spiel ruckelt wenn einige
Objekte auf dem Bildschirm sind, das ist wirklich nicht n&ouml;tig - technisch
gesehen ist selbst Crescent Galaxy besser. Pinball Fantasies bietet wesentlich bessere Grafik, schnelleres sauberes Scrolling und kein Ruckeln!
<P>
<H4>Die Muzak</H4>
<P>
Die Musik ist wirklich m&auml;ssig und Pinball Fantasies ist auch in diesem
Bereich klarer Punktsieger.
<P>
<H4>Spielerisch</H4>
<P>
Was haben sie die Programmierer dabei gedacht? Das Ballverhalten ist &auml;u&szlig;erst
ungew&ouml;hnlich, durch das ruckelt - das miese zoomen und die zu gro&szlig;en Tische
etc. ist das Spiel absolut un&uuml;bersichtlich geworden und es ist eher mit
einem Gl&uuml;ckspiel zu vergleichen als mit einem Flipper. Auch habe ich keine
Motivation einen Tisch zu spielen, wo ich einen feindlichen Angriff abwehren mu&szlig; und zum Gegenschlag aushole. Dies ist wirklich das d&auml;mmlichste
was ich seit langem gesehen und gespielt habe...
<P>
Dies ist wirklich kein "Vielfach Flipper Fest!" wie es auf der Verpackung
steht! Dies ist noch nicht wiederverwerteter M&uuml;ll, f&uuml;r absolute Pinball-
Freaks mag das Spiel eventl. noch unterhaltsam sein, aber jeder Menschen
mit gesundem Menschenverstand sollte die Finger von Ruiner Pinball lassen.
L&auml;ngerer "Genuss" von Ruiner soll die selben Auswirkungen wie BSE haben...
<P>
<TABLE align=center border width=50>
<TR>
<TH>Grafik<TD align=center>45 %
<TR>
<TH>Sound<TD align=center>40 %
<TR>
<TH>Gesamt<TD align=center>40 %
</TABLE>

<HR>
Zuletzt geändert: Monday, 6. May 1996
</BODY>

</HTML>
