<HTML>

<HEAD>
<!-- erstellt: 07.05.1996 13:51:07 -->
<TITLE>Syndicate</TITLE>
</HEAD>

<BODY>
<H1>Syndicate</H1>
<HR>
<H3>Syndicate - Metzeln mit Strategie!</H3>

<P ALIGN=justify>Bullfrog Productions, die Erfinder von zahlreichen Top-Spielen wie:
"Populous 1+2", "Powermonger", "Theme Park" und "Magic Carpet" konvertierten
uns eines der erfolgreichsten PC-Spiele aus dem Jahre 1993 names
"Syndicate" auch f&uuml;r unsere 64-Bit Raubkatze.</P>

<H4>Erstmal zur Story:</H4>
<P ALIGN=justify>In Zukunft wird ein Chip erfunden, der in den Nacken eingepflanzt, wie eine
Droge wirkt und die Endzeitst&auml;dte wie eine "Blumenwiese" aussehen l&auml;&szlig;t.
Alle gro&szlig;en weltbeherrschenden Konzerne wollen diese Chips vermarkten, was
zu einem gro&szlig;en Krieg f&uuml;hrt.</P>

<H4>Deine Aufgabe:</H4>
<P ALIGN=justify>Du leidest einen dieser Konzerne und mu&szlig;t Deine Agenten durch verschiedene
Missionen f&uuml;hren um am Ende dieser Mission jeweils ein Land zu erobern und
dann die Steuern "einzusacken".<BR>
Verschiedene Waffen stehen zur Verf&uuml;gung, wie Uzi, Flammenwerfer (bruzel,
bruzel ;)), oder &Uuml;berzeugungsstrahler (w&auml;re f&uuml;r mich in einige Gruppen
n&uuml;tzlich ;)).<BR>
Die &uuml;ber einen Chip gesteuerten Agenten k&ouml;nnen verschiedene Verkehrsmittel
gebrauchen und andere Menschen als Deckung benutzten (wie gemein ;)).</P>

<H4>Zur Steuerung:</H4>
<P ALIGN=justify>Die Steuerung wurde f&uuml;r Konsolenverh&auml;ltnisse optimal gel&ouml;st, d.h. alle
Tasten des Jaguar-Joypads werden benutzt, nur leider gibt es keine
Overlay-Folie :(<BR>
Mit einer Maus k&ouml;nnte man das Spiel besser steuern, aber auch mit dem
Joypad lassen sich beachtliche Erfolge erzielen, zudem k&ouml;nnte man eine
Maus nicht mit so vielen Knopf-Funktionen belegen und br&auml;uchte eine
Men&uuml;, wo man einzelne Sachen ausw&auml;hlen k&ouml;nnte...<BR>
Vor- und Nachteile der Maus/Joypad-Steuerung wiegen sich gegenseitig auf.</P>

<H4>Technik:</H4>
<P ALIGN=justify>Scheinbar l&auml;uft das Spiel haupts&auml;chlich auf den 68000er, was sich dadurch
bemerkbar macht, da&szlig; wenn mehrere Objekt auf dem Bildschirm sind, da&szlig;
Spiel wirklich lahm wird...<BR>
Die Grafik ist ok, aber der Sound l&auml;&szlig;t mal wieder zu w&uuml;nschen &uuml;brig auch wenn
die "Flammenwerferopfer" noch nett durch die Gegend rennen und schreien ;)
Zus&auml;tzlich zu allen anderen Versionen gibt es bei der Jaguar-Version
noch eine Zoom in/out-Option, welche wirklich sehr gut gelungen ist.
Ein Manko ist eventl., da&szlig; der Spieler nur EINEN Spielstand speichern
kann, d.h. er sollte sehr geschickt vorgehen...<BR>
Ein Passwort-System w&auml;re w&uuml;nschenswerter gewesen, wie auf anderen Systemen.</P>

<H4>Fun:</H4>
<P ALIGN=justify>Der Spielspa&szlig; ist wirklich sehr hoch und die "Geschwindigkeitsprobleme"
st&ouml;ren auf Dauer nicht besonders, da alle Mission sehr spannend und
abwechselungsreich sind.<BR>
Hat der Spieler erstmal die Steuerung begriffen wird er wie besessen
von Mission zu Mission eilen. Syndicate garantiert wochenlangen Spielspa&szlig;,
dank der 50 Missionen... KAUFEN!!!
</P>
<TABLE ALIGN=center BORDER width=50>
<TR>
<TH>Grafik<TD ALIGN=center>50 %
<TR>
<TH>Sound<TD ALIGN=center>35 %
<TR>
<TH>Gesamt<TD ALIGN=center>80 %
</TABLE>


<HR>
</BODY>

</HTML>
