<HTML>

<HEAD>
<!-- erstellt: 08.05.1996 06:13:33 -->
<TITLE>Theme Park</TITLE>
</HEAD>

<BODY>
<H1>Theme Park</H1>
<HR>
<H3>Disneyland auf dem Jaguar</H3>

<P ALIGN=justify>Es ist Wochende, das Wetter ist wiedermal beschissen da kommt gerade
der Postbote und bringt mir eine neues Jaguar Spiel!!
(sabbel!!! lechz!! sabbel!!!)</P>

<P ALIGN=justify>Die Macher von Populous 1+2, Powermonger, Syndicate und Magic Carpet
bescherten uns mit "Theme Park" ein Spiel in dem sich der Spieler nicht
in die Vergn&uuml;gen eines Freizeitparks st&uuml;rzen darf, sondern dazu da ist,
anderen Leuten diese Freude zu erm&ouml;glichen. Es handelt sich bei "Theme Park"
um eine knallharte Wirtschaftssimulation, die keinen Vergleich mit anderen
Spielen dieses Genres, wie z.B. "Railroad Tycoon", "Sim City", "Die Siedler",
oder "Aufschwung Ost" zu scheuen braucht, und es liegt am Spieler, ob sich
ein bl&uuml;hender Freizeitpark entwickelt oder ob er mit einen drittklassigen
Rummelplatz in die Pleite f&auml;hrt.</P>

<P ALIGN=justify>Leider ist das Spiel komplett in englisch und es gibt leider keine deutsche
Anleitung im Handbuch, alle "Englischmuffel" werden wohl etwas Schwierigkeiten haben.</P>

<P ALIGN=justify>Nun zum Spiel! Der Park mu&szlig; nun gebaut werden. Hierzu ben&ouml;tigt man ein
passendes Gel&auml;nde, das auch eine gen&uuml;gende Infrastruktur aufweisen mu&szlig;.
Das Spiel pr&auml;sentiert mehrere m&ouml;gliche Standorte auf dem ganzen Globus.
Je nach Lage sind sie unterschiedlich teuer. Lediglich der Platz in England
ist kostenlos (wir waren vor ein paar Tagen in England und wissen warum ;)).
Nachdem dieser gew&auml;hlt wurde (es bietet sich an, da das Geld sowieso knapp
ist), k&ouml;nnen die Bauarbeiten beginnen.</P>

<P ALIGN=justify>Auf dem Bildschirm erscheint eine gro&szlig;e, von einer Mauer umgebene Rasenfl&auml;che mit einem Eingangstor. Mehr ist nicht vorhanden.<BR>
Der Park ist noch verschlossen, aber ab und zu schaut schon einmal ein
Besucher durch das verriegelte Tor, ob sich nicht schon was tut.<BR>
Mit Hilfe von Icons werden jetzt Wege angelegt, Fahrgesch&auml;fte eingerichtet,
Eisbuden aufgestellt und B&auml;ume gepflanzt.</P>

<P ALIGN=justify>Die M&ouml;glichkeiten sind am Anfang etwas beschr&auml;nkt, da nur wenige, langweilige
Fahrgesch&auml;fte und f&uuml;r das leibliche Wohl der Besucher nur wenig "Konsumbuden"
zur Verf&uuml;gung stehen.</P>

<P ALIGN=justify>Hier kann man nur eine Investion in die Forschung Abhilfe schaffen.
Dies ist zwar teuer, aber unerl&auml;&szlig;lich, will man &uuml;ber kurz oder lang mit
einem Haufen murrender Besucher in einem stinklangweiligen Park dastehen.
Wenn der Spieler glaubt, alles erledigt zu haben, was zur Er&ouml;ffnung notwendig ist - Wege sind angelegt, Fahrgesch&auml;fte errichtet, Buden sind zum
Verkauf bereit, Plumpsklos sind aufgestellt (hoffentlich werden bald
bessere Toiletten erfunden) und das Personal ist eingestellt (irgendwer
mu&szlig; ja den Dreck wegr&auml;umen, Defekte an den Fahrgesch&auml;ften beheben, f&uuml;r
Ordnung sorgen und die Besucher unterhalten) - kann das Vergn&uuml;gen losgehen.
Der erste Bus h&auml;lt vor dem Tor, die ersten G&auml;ste str&ouml;men auf das Gel&auml;nde
und fangen hoffentlich an, sich zu am&uuml;sieren.</P>

<P ALIGN=justify>Ob dies der Fall ist, kann auf einem speziellen Besucherbildschirm ersehen
werden. Hier ist zu sehen, wieviele Besucher der Park gerade hat, ob diese
Leute sich am&uuml;sieren oder sich langweilen oder auch welche speziellen
W&uuml;nsche (Hunger, Durst, Am&uuml;sement usw.) sie haben. Diese W&uuml;nsche zeigen die
Besucher mit einer kleinen Sprechblase &uuml;ber ihren K&ouml;pfen, und man sollte
als Parkbesitzer auf sie eingehen, will man nicht, da&szlig; die Besucherzahl
r&uuml;ckl&auml;ufig wird. Da ist es schon &uuml;bel, wenn fast alle Leute mit Hunger und
Durst auf Hamburger und Cola in den Park kommen und dort nur Eisbuden vorfinden. Doch wenn der Parkbesitzer in die richtigen Forschungsgebiete
investiert hat, dann ist dieser Mi&szlig;stand bald aus der Welt geschaffen.
Dann ist die Pommesbude und der Cola-Stand erfunden.</P>

<P ALIGN=justify>Auch reichen die vorhandenen Fahrgesch&auml;fte &uuml;ber kurz oder lang nicht
mehr aus. Es m&uuml;ssen neue Attraktionen her, damit niemand im Park wom&ouml;glich
noch einschl&auml;ft. Ehe man sich versieht, ist f&uuml;r den Park ein Jahr vergangen, und die Jahresabschlu&szlig;liste erscheint auf dem Bildschirm.
Hier kann der Parkbesitzer sehen, wo er steht.
Es werden Aussagen zum Ruf des Parks, zu seiner Sicherheit, Attraktivit&auml;t,
Sauberkeit und &auml;hnlichem getroffen.</P>

<P ALIGN=justify>Hat man in einer Kategorie besonders gut abgeschnitten, gibt es eine kleine
Geldpr&auml;mie (am Beginn des Spiels sehr wichtig, doch sp&auml;ter, wenn Millionen
flie&szlig;en "Peanuts"), ist die Bemerkung in einer Kategorien hingegen in rot
geschrieben, ist im Park etwas gr&uuml;ndlich in die Hose gegangen, und man tut
gut daran, Fehler zu beheben.
</P>
<P ALIGN=justify>Nach dem Jahresabschlu&szlig; geht es munter weiter im Park.
Das Wegenetz wird erweitert, neue Fahrgesch&auml;fte werden errichtet, die
Verkaufbuden m&uuml;ssen mit Nachschub versorgt werden, Defekte m&uuml;ssen behoben
und es mu&szlig; alles sauber gehalten werden (bessere Toiletten m&uuml;ssen gebaut
werden, soweit sie schon erfunden sind).</P>

<P ALIGN=justify>Das Ganze kann nat&uuml;rlich nur im Rahmen der vorhandenen Finanzen geschehen,
da der Kreditrahmen begrenzt ist. Um diese Finanzen zu verbessern, kann man
als Parkbesitzer nat&uuml;rlich an den Preisen drehen.</P>

<P ALIGN=justify>Wann und wo das m&ouml;glich ist, l&auml;&szlig;t man sich am Anfang besser von einem
Berater sagen, der genau beobachtet, wo die Leute bereit sind, mehr
Geld auszugeben. Wird der Park f&uuml;r die Besucher zu teuer, bleiben Sie
nat&uuml;rlich zu Hause.
Die Jahre vergehen, der Park wird immer gr&ouml;&szlig;er, es kommen immer mehr
Besucher und es gibt immer mehr Probleme:</P>
<P>
<UL>
<LI>Viele Besucher verzehren viel, und es m&uuml;&szlig; daf&uuml;r gesorgt werden, da&szlig; trotz
  langer Lieferzeiten immer genug Waren im Lager sind. Was n&uuml;tzen die
  sch&ouml;nsten Gesch&auml;fte, wenn sie nichts zu verkaufen haben.
<P>
<LI>Viele Besucher, die etwas verzehren, hinterlassen nat&uuml;rlich auch viel
  M&uuml;ll. F&uuml;r die Beseitigung des Abfalls m&uuml;ssen Aushilfen eingestellt werden,
  und man mu&szlig; diesen faulen Burschen auch noch genau zeigen, welchen Bereich
  sie zu betreuen haben, da sie sie sich sonst nur verkr&uuml;meln.
<P>
<LI>Wenn viele Fahrgesch&auml;fte aufgestellt sind, gehen immer wieder welche zu
  Bruch. Es m&uuml;ssen also gen&uuml;gend Mechaniker eingestellt werden, um die
 notwendigen Reparaturen durhzuf&uuml;hren. Tut man das nicht, dann explodieren
  die Fahrgesch&auml;fte, dies f&ouml;rdert den Ruf des Parks nicht unbedingt.
<P>
<LI>Ein gro&szlig;er Park wird leicht un&uuml;bersichtlich. Wenn Besucher herumirren,
  sind sie zu besch&auml;ftigt mit der Wegsuche, um irgendwo Geld auszugeben.
</UL>

<P ALIGN=justify>Doch nun genug der Probleme. Wenn Sie einem &uuml;ber den Kopf wachsen, hat man
als Besitzer ja seinen Berater, der das N&ouml;tigste im Auge beh&auml;lt und auf
notwendige Ma&szlig;nahmen hinweist. Man kann sich getrost daran machen, den Park
optisch zu versch&ouml;nern. Hierzu gibt es viele Sorten von B&auml;umen, Str&auml;uchern
und Blumen. Oder man schaut sich auf dem Aktienmarkt um und versucht dort,
sofern es die Finanzen erlauben, Aktien des eigenen oder von anderen Parks
zu erwerben. So ist es m&ouml;glich, diese zu &uuml;bernehmen, andere Parkbesitzer
k&ouml;nnen dies nat&uuml;rlich auch versuchen.</P>

<P ALIGN=justify>Irgendwann ist das vorgegebene Gel&auml;nde ausgef&uuml;llt. Der Park ist an seine
Grenzen gekommen. Man kann ihn jetzt immer weiter verbessern und versch&ouml;nern, oder aber er wird auf einer Aktion einfach verkauft.
Mit dem eingenommenen Geld kann der Spieler jetzt ein gr&ouml;&szlig;eres Gel&auml;nde
an einem besseren Standort erwerben. Dort geht dann alles wieder von vorn
los, denn auch hier gibt es nur ein leeres Grundst&uuml;ck.
Und bis man als Parkbesitzer wieder in der Lage ist, gl&uuml;ckliche Besucherstr&ouml;me mit so kleinen Dingen wie der Salzmenge auf den Pommes, den Gewinnchancen beim Entenwerfen oder der Koffeinmenge im Kaffee zu lenken, mu&szlig;
noch viel Arbeit geleistet werden und alles nur, damit andere sich am&uuml;sieren.</P>

<P ALIGN=justify>Theme Park ist ein sehr gut gemachte und aufwendige Freizeitpark-Simulation.
Es bietet f&uuml;r jede Spielst&auml;rke etwas, da der Spieler entsprechend seiner
F&auml;higkeiten mehr oder weniger Entscheidungen &uuml;bernehmen kann und so weder
unter- noch &uuml;berfordert wird. Da es in Echtzeit abl&auml;uft, bietet es immer
Abwechslung, das Einzige, was nicht passiert, ist, da&szlig; nichts passiert.</P>

<TABLE ALIGN=center BORDER width=50>
<TR>
<TH>Grafik<TD ALIGN=center>85 %
<TR>
<TH>Sound<TD ALIGN=center>80 %
<TR>
<TH>Gesamt<TD ALIGN=center>90 %
</TABLE>


<HR>
</BODY>

</HTML>
