<HTML>

<HEAD>
<!-- erstellt: 06.05.1996 08:02:11 -->
<TITLE>Attack of the Mutant Penguins</TITLE>
</HEAD>

<BODY>
<H1>Attack of the Mutant Penguins</H1>

<HR>

<H2>S.O.S.!!!</H2>
<P>
Nach Schweinepest und Rinderwahn droht der Menschheit nun eine neue Gefahr!
Au&szlig;erirdische verkleiden sich als Pinguine und versuchen dadurch die
Weltherrschaft zu erringen, ob es ihnen gelingt h&auml;ngt mal wieder vom
Spieler ab, welcher bei diesem au&szlig;ergew&ouml;hnlichen Spiel seine grauen
Zellen (falls verhanden) das ein oder andere Mal benutzen sollte.
<P>
Anfangs kann der Spieler seinen Superhelden ausw&auml;hlen, Bernard und Rodney
sind n&auml;mlich unterschiedlich bewaffnet. Der eine hat z.B. eine simple Brat-
pfanne, w&auml;hrend der andere seine Keule bevorzugt (nicht was ihr jetzt denkt).
<P>
Am Anfang jedes Level sollte sich der Spieler genau anschauen, wo welche
Objekte (blaue Gremlins, gute und b&ouml;se Pinguine) und Gegenst&auml;nde (da
w&auml;ren Br&uuml;cken, Schalter, Kisten, Musikboxen, Maschinen, Fallen etc.) sind.
<P>
Danach sollte der Spieler so schnell wie m&ouml;glich die blauen Gremlinge ein-
sammeln, die dazu dienen Fallen zu bauen und Kisten die n&uuml;tzlich Extras
enthalten zu &ouml;ffnen. Der Spieler hat zu diesem Zeitpunkt noch keine Waffe
und mu&szlig; erst drei Kisten &ouml;ffnen in denen drei unterschiedliche Buchstaben
sind, die eingesammelt werden m&uuml;ssen und erst danach kann er die b&ouml;sen
Pinguine verdreschen, aber noch nicht t&ouml;ten, da er nicht gen&uuml;gend Energie
zur Verf&uuml;gung hat. Mit der normalen Waffe kann er die b&ouml;sen Pinguine nur
f&uuml;r ein kurzen Moment bet&auml;uben und Energiekapsel, die die b&ouml;sen Pinguine
verlieren so schnell wie m&ouml;glich einsammeln, ohne nochmal von seiner
Waffe Gebrauch zu machen. Hat der Spieler es geschafft f&uuml;nf Energiekapseln
einzusammeln wird seine Waffe st&auml;rker und er ist in der Lage die Penguine
zu t&ouml;ten. Mit jeden Schlag verliert, er aber Energie und nach f&uuml;nf bis
sechs t&ouml;dlichen Schl&auml;gen mu&szlig; er wieder Energiekapseln sammeln.
<P>
Zus&auml;tzlich gibt es noch diverse Extras wie z.B. Dynamit mit denen man die
b&ouml;sen Pinguine im wahrsten Sinne des Worte in die Luft sprengen kann.
<P>
Dies geht so lange bis die Invasion der Pinguine in diesem Level gestoppt
ist. Das Spiel (Game Over) ist beendet, wenn der Spieler die b&ouml;sen Pinguine
bis zur Waage des Schicksal kommen l&auml;&szlig;t, da auf dieser immer mehr gute
Penguine als B&ouml;se seinen m&uuml;ssen.
<P>
W&auml;hrend der Levels gibt es noch drei witzige Bonusspielchen...
<P>
Pinguin-Attack:  Ein Space Invaders-Cone mit Pinguinen.
Pinguin-Range:   Tontaubenschiessen mit Pinguinen.
Pinguin-Control: Wer versenkt die meisten Eisscholen mit Pinguinen?
<P>
...die f&uuml;r den n&auml;chste Level sehr wichtig sind, da der Erfolg bei diesen
Bonusspielen dem Spieler mehr gute Pinguine auf der Waage des Schicksals
bescherrt und in h&ouml;heren Levels ist es immer gut ein paar Reserven auf der
Schicksals-Waage zu haben, wenn ein paar b&ouml;se Pinguine mal zur Waage
gelangen sollten.
<P>
Die Grafik ist sehr farbenfroh und kann als gut bis sehr gut bezeichnet
werden, leider geht das Spiel bei vielen Objekten ziemlich in die Knie.
W&auml;hrend des Spiels gibt es bis auf die Level mit Jukebox keine Musik,
sondern nur Soundeffekte was eigentlich sehr schade ist. Die Titelmusik
und auch die Musik in den Jukebox-Leveln ist okay. Das Gameplay ist absolut
genial, endlich mal wieder eine neue geniale Spielidee, welche auch auf
Dauer motivieren kann... Bei mehr Leveln w&uuml;rde das Spiel einen absoluten
Kult-Status wie z.B. Lemmings geniessen.
<P>
Fazit: Ein hervorragendes Spiel, welches ein absoluter Tophit geworden w&auml;re,
       wenn es nicht nur mickrige 20 Level gehabt h&auml;tte, welches nat&uuml;rlich
       zu einer Abwertung (85% statt 90%) f&uuml;hrt.
<P>
<TABLE align=center border width=50>
<TR>
<TH>Grafik<TD align=center>85%

<TR>
<TH>Sound<TD align=center>40%

<TR>
<TH>Gesamt<TD align=center>85%
</TABLE>


<HR>
</BODY>

</HTML>