<HTML>

<HEAD>
<!-- erstellt: 06.05.1996 10:38:44 -->
<TITLE>Fight for Life</TITLE>
</HEAD>

<BODY>
<H1>Fight for Life</H1>
<HR>
<P>
Nach langer Wartezeit ist nun das erste 3D-Beat'em Up f&uuml;r den Atari Jaguar
erschienen. Im Mai 1994 wurde das Projekt gestartet um zu beweisen, da&szlig;
auch der Jaguar den neueren Konsolen wie z.B. Sony Playstation und Sega
Saturn Paroli bieten kann. Ist das Projekt gelungen?
<P>
Um es vorweg zu nehmen: Die Grafik ist wirklich sehr gut gelungen und 
ein Gro&szlig;teil der Figuren sieht besser aus als bei Virtua Fighter 1 auf dem
Sega Saturn, aber spielerisch wurde geschlampt. Die einzelnen Figuren haben
leider relativ wenige Moves, auch die Framerate bewegt sich bei etwas &uuml;ber
20 Bildern pro Sekunde, was f&uuml;r den Jaguar sehr gut ist, aber die Konkurenz
ist halt 50% fl&uuml;ssiger (30 Bilder pro Sekunde).
<P>
Ich m&ouml;chte jetzt keinem Fight for Life pomadig machen, aber wer ein Hammerspiel erwartet, der wird nat&uuml;rlich entt&auml;uscht sein...
<P>
Insgesamt stehen acht K&auml;mpfer zur Verf&uuml;gung names Kimura (Ninja), Ian
(Soldat), Kara (Amerikanische Mutti), Pog (Hafenarbeiter), Mr. G (Boxer),
Muhali (Arabischer K&auml;mpfer), Jenny (Die Frau von Welt) und Lun der ein
chinesischer Kung Fu-Meister ist.
<P>
Fairerweise mu&szlig; man aber auch erw&auml;hnen, da&szlig; es ein 32MBit-Modul-Spiel
ist und auch einige nette Ideen realisiert wurden, wie z.B. ein Replay-
Modus, sowie die M&ouml;glichkeit aus jeder beliebigen 3D-Perspektive zu
k&auml;mpfen. Auch die Idee, da&szlig; man seinen Gegner bei Sieg die Moves klauen
kann und so nach und nach sich per Passwort ein Super-K&auml;mpfer zusammenstellen kann ist genial.
<P>
<TABLE>
<TR>
<TH valign=top>Fazit: 
<TD>   Fight for Life hat f&uuml;r Jaguar-Verh&auml;ltnisse eine sehr gute Grafik-
       Engine und auch die Musik ist gelungen. Spielerisch kann es aber
       nicht mit anderen 3D-Beat"em Ups wie z.B. Tekken 1+2 oder Virtua
       Fighter 1, Remix+2 mithalten. Eigentlich schade, aber man w&auml;re
       ein grosser Narr, wenn man was anderes erwartet h&auml;tte.
       Ein Kaufempfehlung kann aber trotz der spielerischen M&auml;ngel ausgesprochen werden, vor allem f&uuml;r Jaguar Only-Konsolenbesitzer.
</TABLE>
<P>

<TABLE border width=50 align=center>
<TR>
<TH>Grafik<TD align=center>95%
<TR>
<TH>Sound<TD align=center>85%
<TR>
<TH>Gesamt<TD align=center>75%
</TABLE>


<HR>
</BODY>

</HTML>