<HTML>

<HEAD>
<!-- erstellt: 17.07.1996 08:37:54 -->
<TITLE>FLASHBACK</TITLE>
</HEAD>

<BODY>
<H1>FLASHBACK</H1>

<HR>

<H3>FERTIGGERICHT 3???</H3>

<P>Nach jahrelanger Wartezeit, pr&auml;sentiert uns Delphine Software und U.S. Gold
einen Konvertierung der Mega Drive-Version, welche schon vor mehr als zwei
Jahren f&uuml;r Furore gesorgt hat. Leider wurde das Spiel weder grafisch noch
akustisch auf 64-Bit Niveau gepusht, was schon mehr als &auml;rgerlich ist.</P>

<P>Eure Aufgabe ist es, ein aufwendig animiertes Sprite durch die Gegend
zu lenken. Aber zuerst einmal die Story: Die Titelfigur names Conrad Hart,
welcher Student des Galaxial Bureau of Investigation und seines Zeichens
Meister des Simulationstrainings f&uuml;r Agenten (Codename "Flash") ist.
Bei einer Demo gegen den neuen Pr&auml;sidentschaftanw&auml;rter entdeckt er durch
einen Zufall, da&szlig; der Kandidat ein Alien ist. Von da an wird er verfolgt
und zwei Tage sp&auml;ter gefa&szlig;t. Dem Bewu&szlig;tlosen wird das Ged&auml;chtnis geraubt
und er erwacht auf den unfreundlichen Kolonialplaneten Titan inmitten
eines verwilderten Urwaldes. Beim Aufstehen st&ouml;&szlig;t er einen Holographie-
Cubus von der Plattform, auf der er liegt. Diesen hat er kurz vor seiner
Gefangennahme eingesteckt und im Augenblick stellt er die einzige Ver-
bindung zu seiner wahren Identit&auml;t dar.</P>

<P>Mit der Suche nach dem Kubus, dessen Aufzeichung uns zu einem ehemaligen
Studienkollegen Conrads f&uuml;hrt, beginnt ein turbulentes Abenteuer voller
R&auml;tsel, schneller Aktion und den permanenten Zwang zum Handeln.</P>

<P>In New Washington m&uuml;&szlig;t Ihr zu Geld kommen, um Conrad zu einer falschen
Identit&auml;t zu verhelfen. Mittlerweile ist der Name auf den Fahmdumgslisten
aufgetaucht. Da zum Kauf eines Raumtickets zur Erde eine horrende Summe
n&ouml;tig ist, hilft nur eins: beim Todesspiel als "Running Man" im Death Tower
eine Freiflug zu gewinnen - als Preis f&uuml;rs &Uuml;berleben.
</P>
<P>Auf der Erde wird die falsche Identit&auml;t aufgedeckt und die Polizei hetzt
Euch durch die futuristischen Stra&szlig;en. Nach der Aufdeckung des Komplotts
schnappen die Aliens Conrad erneut und entf&uuml;hren ihn zu ihrem Heimatplaneten
Morphs. Um alle Abenteuer zu &uuml;berstehen, mu&szlig; Conrad eine ganze Reihe von
Gegenst&auml;nden (&uuml;ber 20!) finden. Einige sind hilfreiche Extras, andere
Fundst&uuml;cke m&uuml;ssen von A nach B transportiert werden.</P>

<P>Gottseidank ist Conrad ein ausgebildeter Sch&uuml;tze - hinter jeden Ecke lauern
Gefahren, die Ihr mit gro&szlig;em Kaliber und schnellem Finger beseitigt.
Neben Sammeln und Ballern redet Ihr mit Leuten, fahrt Taxi, oder erkundet
die Stadt mit der S-Bahn. Etwa 15 unterschiedliche Bewegungen lassen Conrad
atemberaubend menschlich aussehen. Die aufwendigen Grafiken der Mega Drive-
Version welche 1:1 auf den Jaguar konvertiert wurden, decken den gesamten
Bereich von Urwelt, Real- und SF-Szenario ab.</P>

<P>Die drei Schwierigkeitsgrade unterscheiden sich in der Anzahl der Gegner.
St&uuml;rzt Ihr ab oder werdet von mehr Kugel getroffen, als euer Held vertr&auml;gt,
stehen Euch unbegrenzt Continues zur Verf&uuml;gung.</P>
<P>
<TABLE><TR><TH VALIGN=top ROWSPAN=2>Fazit:</TH> <TD>Flashback ist ein umfangreiches Jump'n'Run-Aktion-Adventure und
       kann allen Jaguar-Freaks ans Herz gelegt werden, die keine hohen
       Anspr&uuml;che an Grafik und Sound stellen.</TD></TR>
       <TR><TD>Wer Flashback schon auf anderen Systemen hat, bzw. schon gespielt hat
       f&uuml;r den lohnt sich der Kauf auf keinen Fall, aber f&uuml;r jemanden der
       Flashback nicht kennt k&ouml;nnte es eine gute &Uuml;bergangsbesch&auml;ftigung
       darstellen bis Rayman erscheint... ;)</TD></TR></TABLE>
<P>
<TABLE BORDER aling=center>
<TR><TD>Grafik</TD> <TD>50 %</TD><TD>Grafik 1:1 zur Mega Drive-Version</TD></TR>
<TR><TD>Sound</TD><TD>40 %</TD><TD>Musik und Soundeffekte zur Mega Drive-Version</TD></TR>
<TR><TD>Gesamt</TD><TD>75 %</TD><TD>Gutes Gameplay</TD></TR>
</TABLE>
<HR>
</BODY>

</HTML>