<HTML>

<HEAD>
<!-- erstellt: 09.08.1996 08:08:37 -->
<TITLE>SUPER BURNOUT</TITLE>
</HEAD>

<BODY>
<H1>SUPER BURNOUT</H1>

<HR>

<P>So, nachdem f&uuml;r mich in den letzten Monaten ziemliche Saure-Gurken-Zeit in
Bezug auf neue Jag-Games war, die meisten Umsetzungen interessierten mich
nicht, da ich sie von meinem Amigo ;-) her kenne, und Hover Strike nach 2
Wochen wieder verkauft hatte, da ich es nicht so toll fand, hat nun endlich
wieder ein wirklich gutes Spiel - <B><I>Super BURNOUT</I></B> - den Weg in meine
Spiele-Sammlung gefunden.</P>

<P>Gleich noch eines vorweg: Als ich mein Modul in den Jaguar steckte und ihn
anschaltete, bekam ich gleich einen roten Bildschirm. Nach erneutem
reinstecken tat sich dann gar nichts mehr. Als ich mir daraufhin mal die
Platinenkontakte des Moduls ansah, entdeckte ich genau hinter dem Geh&auml;use
einen L&ouml;tbatzen. Zum Gl&uuml;ck bekam ich ihn problemlos raus und jetzt l&auml;uft
das Game einwandfrei. Ich sage das nur, weil es auch schon in der
Vergangenheit einige Kandidaten mit &auml;hnlichen Problemen gab und SBO scheint
auch so einer zu sein.</P>

<P>Das Modul sollte zwischen 109,- und 119,- DM, so hier in Hannover, zu
bekommen sein. In der Verpackung findet man neben dem Modul noch die
dreisprachige Anleitung, wie man es von Atari-Releases gewohnt ist. Ein
Overlay ist nicht dabei, ist aber auch nicht n&ouml;tig, da man lediglich das
Steuerkreuz und die 3 Fire-Buttons zum Spielen braucht. Das Spiel ist in
NTSC-Overscan programmiert, sodass auch auf einer PAL-Konsole bei 50 Hz
keine Balken vorhanden sind.</P>

<P>Bei <I><B>Super BURNOUT</B></I>, nur f&uuml;r die, die es nicht wissen, handelt es sich um
ein Motorradrennspiel, das in die Richtung von <I>Super Hang On</I> geht. Bei SB
stehen einem vier Rennarten zur Verf&uuml;gung:</P><P>
<TABLE>
<TR><TD>1.</TD><TH>Trainer Mode</TH>       <TD>hier f&auml;hrt man gegen sechs Computergegner (Dronen)
		       auf einer beliebig ausgew&auml;hlten Strecke.</TD></TR>
 
<TR><TD>2.</TD><TH>Versus Mode</TH>        <TD>hier kann man sich mit einem Freund ein hei&szlig;es
		       Rennen via Splitscreen liefern. Die Strecken sind
		       frei w&auml;hlbar.</TD></TR>
 
<TR><TD>3.</TD><TH>Championship Mode</TH>  <TD>hierbei f&auml;hrt man alle acht Rennstrecken gegen
		       sechs Dronen.</TD></TR>
 
<TR><TD>4.</TD><TH>Record Mode</TH>        <TD>in diesem Mode f&auml;hrt man auf einer frei gew&auml;hlten
		       Strecke allein nur gegen die Zeit.</TD></TR></TABLE>
<P> 
<P>Bei den Motor&auml;dern stehen einem sechs verschiedene Maschinen mit
unterschiedlichen Eigenschaften bez&uuml;glich <I>Grip</I>, <I>Acceleration</I> und <I>Max</I>
<I>Speed</I> zur Auswahl zur Verf&uuml;gung. Es n&uuml;tz aber z.B. nichts, sich einfach
die schnellste Maschine zu schnappen, in der Hoffnung, da&szlig; man damit auf
jeden Fall gewinnt, denn diese hat z.B. den schlechtesten Grip. Es kann
also durchaus sein, da&szlig; jemand mit einer langsameren Maschine gewinnt,
weil andere Eigenschaften besser sind.</P>

<P>An Rennstrecken stehen insgesamt 8 zur Verf&uuml;gung. Gut finde ich dabei,
da&szlig; nicht alle einfach im Uhrzeigersinn zu fahren sind, sondern ein Teil
auch entgegengesetzt zu durchfahren sind. Au&szlig;erdem unterscheidet man die
Kurse noch nach drei Kriterien: <I>Technisch</I>, <I>Semi-Technisch</I> und
<I>Hochgeschwindigkeit</I>. Diese Arten dr&uuml;cken aus, ob es sich um eine Strecke
mit hohen fahrerischen Anforderungen, z.B. mit vielen Kurven, handelt oder
ob man einfach drauf losfahren kann.</P>

<P>&Uuml;ber die Spiel-Optionen kann man die Dronenst&auml;rke, leider nicht deren
Anzahl, die Rundenzahl, 2 bis 7,  ob man Schaltung oder Automatik f&auml;hrt
und auch die Joypad-Einstellung vornehmen. Zus&auml;tzlich kann man sich die
Musiken anh&ouml;ren und die Rekorde abrufen. Gespeichert werden &uuml;brigens nur
getrennt die Runderekorde und die besten Durchschnittszeiten pro Runde mit
Namen f&uuml;r jede Strecke einzeln.</P>

<P>Auch Unf&auml;lle kann man nat&uuml;rlich verursachen, z.B. wenn man auf stehende
Hindernisse auff&auml;hrt. Zu Unf&auml;llen mit Gegnern kommt es aber nur, wenn die
Differnz der Geschwindigkeiten relativ gross ist. Bei etwa gleicher
Geschwindigkeit wird man lediglich etwas abgebremst und in der
Geschwindigkeit zur&uuml;ckgeworfen.</P>

<P>
<B>Grafik :</B>

<P>Wer eine Grafik wie bei Daytona oder Ridge Racer erwartet hat, wird
vielleicht entt&auml;uscht sein, denn das bietet SB nicht. Aber sie ist
dennoch sehr ansprechend, detailliert und abwechslungsreich. Jede
Strecke bietet neue Eindr&uuml;cke. F&uuml;r zus&auml;tzliche Abwechselung sorgen z.B.
neben den Tagesfahrten auch noch Nachtfahrten oder Rennen, bei denen ein
butterweicher Wechsel von Tag auf Nacht oder umgekehrt stattfindet. Echt
toll. Dieses kann man aber nicht einstellen, sonder ist bei den Strecken
entsprechend eingebaut. Zus&auml;tzlich sind noch weitere gute Effekte
vorhanden. So hinterl&auml;&szlig;t zum Beispiel die eigene Maschine entsprechend
ihrer Beschleunigungsf&auml;higkeit Reifenspuren beim Beschleunigen auf dem
Asphalt. Nach Unf&auml;llen, kann es z.B. sein, da&szlig; ein &Ouml;lfleck zur&uuml;ckbleibt,
der in den n&auml;chsten Runden recht gef&auml;hrlich werden kann. Bremst man,
leuchtet auch das R&uuml;cklicht des Motorrades auf oder bei Dunkelheit sieht
man die Scheinwerferlichtkegel vor den Motorr&auml;dern, was besonders hei&szlig;
ist, wenn man ein heisses Rennen f&auml;hrt und knapp hinter einem die
Lichtkegel der Gegner auf dem Asphalt zu sehen sind.</P>

<P>
<B>Musik</B>:

<P>Jede Strecke hat eine eigene Ingame-Musik. Zus&auml;tzlich gibt es noch in den
verschieden anderen Bildschirmen andere Musiken. Mir gefallen allen, und
es sind einige, sehr gut und die Qualit&auml;t ist hervorragend. IMO die beste
Musik seit T2K und auch nur ganz knapp dahinter. Also am Besten die Anlage
voll aufdrehen.</P>

<P>
<B>Sound-FX</B>:

<P>Super. Eine wiklich gute Stimme macht Ansagen in super Qualit&auml;t,
wenn man die Start-/Ziellinie passiert. Die Motorenger&auml;usche und anderes
sind ebenfalls gut. Toll sind auch die Zuschauer, die jubeln und
klatschen, wenn man an den Trib&uuml;nen vorbeif&auml;hrt. Gef&auml;llt mir wirklich alles
sehr gut.</P>

<P>
<B>Geschwindigkeit</B>:

<P>Was soll man zu <B>60 fps</B> sagen. Absolut super schnell und butterweich. Wer
da ein Ruckeln entdeckt, hei&szlig;t entweder Schober ;-) oder hat was an der
Waffel. Bei 50 Hz ist das Game nat&uuml;rlich entsprechend lansamer (50 fps),
aber immer noch h&ouml;lle schnell. Mal zum Vergleich, damit man eine
Vorstellung von der Geschwindigkeit hat: Road Rash auf dem 3DO ist wirklich
nicht gerade als langsam zu bezeichnen, aber im Vergleich zu SBO ist es etwa
so, als wenn man Moped f&auml;hrt (das soll es jetzt aber wirklich nicht
abwerten).</P>

<P>
<B>Steuerung</B>:

<P>K&ouml;nnt ihr euch noch an CF erinnern? Keine Angst, hier ist sie wirklich
sehr gut. Innerhalb k&uuml;rzester Zeit kommt man sehr gut damit zurecht und
kann sich mit Freude auf Rekordjagd machen.</P>

<P>
<B>Spielspass</B>:

<P>Es macht wirklich sehr viel Spass und ist immer wieder von Neuem
abwechslungsreich und wird bestimmt nicht schnell langweilig. Dieses wird
u.a. durch die Vielzahl an Variationen durch die Tag-/Nachteffekte und die
verschiedenen Eigenschaften der Motor&auml;der erreicht.</P>

<P>Besonders der 2-Spieler-Modus sorgt mit heissesten Rennen gegen einen
Freund f&uuml;r sehr viel Spass und wiederkehrendes Fahrvergn&uuml;gen. Der
Splitscreen-Mode ist dabei immer noch sehr &uuml;bersichtlich und wirkt
keineswegs st&ouml;rend.</P>

<P>Wer Rennspiele und vorallem Motoradrennen mag, kommt um <B><I>Super BURNOUT</I></B>
nicht herum. Ein absolutes <B>Muss</B> f&uuml;r Freunde dieses Genres.</P>

<P>
<B>Wertungen</B>:
<TABLE BORDER align=center width=50>
<TR align=center><TD>Grafik</TD>	  <TD>80%</TD></TR>
<TR align=center><TD>Musik	</TD> <TD> 90%</TD></TR>
<TR align=center><TD>Sound-FX</TD>  <TD>80%</TD></TR>
<TR align=center><TD>Spielspa&szlig; </TD><TD>90%</TD></TR>
</TABLE>
<P>Meiner Meinung nach reiht sich <B><I>Super BURNOUT</I></B> bei den (bisher) grossen Vier (T2K, AvP,
DOOM und IS) ein.</P>
<HR>
</BODY>

</HTML>