<HTML>

<HEAD>
<!-- erstellt: 17.07.1996 11:32:07 -->
<TITLE>WHITE MEN CAN'T JUMP</TITLE>
</HEAD>

<BODY>
<H1>WHITE MEN CAN'T JUMP</H1>
<HR>

<H3>Na, was haste drauf, Alter?</H3>

<P>Mit solchen Worten wirft die Verpackung von White Men Can't Jump um sich.
Hierbei handelt es sich um ein 2-gegen-2 Basketballspiel aus der drei-
dimensionalen Perspektive, welches mit einer Frame-Rate von 12 bis 18
Bildern pro Sekunden (laut Aussagen des Programmieres) zoomt.</P>

<P>Diese Effekt mag zwar ganz nett sein, aber das Spiel wird dadurch ein
wenig "gew&ouml;hnungsbed&uuml;rftig", d.h. man mu&szlig; sich erst einmal an die etwas
komische Perspektive gew&ouml;nnen.</P>

<P>Insgesamt stehen 15 Teams mit je zwei Spieler zur Auswahl, d.h. es gibt
30 unterschiedlich animierte Figuren. Frauen und Wei&szlig;e sind in diesem
Spiel auch integriert, welche unser Tester den wir aus der untersten
Gosse der PC-Szene geholt haben mit Vorliebe gefault hat. ;)</P>

<P>Was uns am meisten gest&ouml;rt hat ist, da&szlig; unser MS-DOS-Freak nach weniger
als drei Anl&auml;ufen und etwa zwei Stunden Spielzeit im SLAM CITY WETTKAMPF
war und dies ohne die Anleitung des Spiels gelesen zu haben!!
Schon nach kurzer Zeit waren f&uuml;r unseren Tester Drei Punkte-W&uuml;rfe kein
Problem und auch die st&auml;rksten Gegner konnten da nichts machen...
Es scheint so, als h&auml;tten die Designer des Spiels beim Gameplay ein
bischen geschludert, oder wie sollte man sich das sonst erkl&auml;ren?</P>

<P>Die Grafik hat ihre St&auml;rken und Schw&auml;chen, z.B. kann man sich &uuml;ber die
drei-Phasen-Animation der Kredit-Haie kaputtlachen, naja auf CD-ROM mit
Cinepak-Sequenzen w&auml;re da mehr drin gewesen...</P>

<P>Der Sound ist etwas entt&auml;uschend, daf&uuml;r gibt es aber massig Sprachausgabe
w&auml;hrend des Spiels, welche wirklich gut dazu pa&szlig;t.</P>
<P>
<TABLE><TH VALIGN=top>Fazit:</TH> 
       <TD>White Men Can't Jump ist ein ordentliches Basketball-Spiel nach
       amerikanischer "Machart", wer auf so etwas steht kann eigentlich
       bedenkenlos zugreifen. Sollte man allerdings nicht von Sportspielen
       angetan sein, bzw. Basketball nicht m&ouml;gen sollte man lieber die
       Finger davon lassen, auch wenn das g&uuml;nstige Bundle - ein 32MBit-Modul
       und ein Team Tap f&uuml;r nur knapp 130,- DM - zum Kauf locken.
       Zudem stellt sich alleine nur m&auml;ssiger Spielspa&szlig; ein, erst ab
       mehreren Spieler geht der Fun erst richtig los!</TD>
</TABLE>
<P>
<TABLE BORDER align=center>
<TR><TD>Grafik</TD><TD>70 %</TD></TR>
<TR><TD>Sound</TD><TD>60 %</TD> <TD>&ouml;der Sound, aber gute Sprachausgabe</TD></TR>
<TR><TD>Gesamt</TD><TD>80 %</TD> <TD>mit 4 Spieler der gr&ouml;&szlig;te Fun-Faktor, - 1 Spieler = - 10%</TD></TR>
</TABLE>
<HR>

</BODY>

</HTML>