<HTML>

<HEAD>
<!-- erstellt: 07.05.1996 10:18:10 -->
<TITLE>Alien vs. Predator</TITLE>
</HEAD>

<BODY>
<H1>Alien vs. Predator</H1>

<HR>
<H3>KAMPF DER FILMGIGANTEN</H3>
<P>

Nicht nur die Hauptfiguren des endlich erschienenen ID-Software-Killers
sind gigantisch, auch die Lizenzkosten bewegen sich in vergleichbaren
Dimensionen. Haben wir es 'mal wieder mit einer lieblosen Filmadaption
zu tun oder ist tats&auml;chlich noch genug Geld f&uuml;r ein dem Ruf der (Kino-)
Vorbilder entsprechendes, ebenso unterhaltsames und spannendes Spiel
&uuml;briggeblieben ?
<P>
Die Lizenz beschr&auml;nkt sich in diesem Falle allerdings nicht wie bei den
meisten anderen Zelluloid-Umsetzungen auf Computer- oder Videospielsystem allein auf den Namen und die Charaktere, nein, Rebellion/Atari haben
wirklich aus dem Vollen gesch&ouml;pft und pr&auml;sentieren eine (wie vom Titel
her zu schliežen) vielversprechende Symbiose aus den Erfolgsstreifen
Alien 1-3 und Predator 1 bzw. 2, wobei sogar nicht auf das Verwenden der
original Soundeffekte (z.B. das Kreischen der Aliens bei einem Treffer)
verzichtet worden ist. Um das Spiel noch interessanter zu gestalten,
wurde als dritter Akteur noch ein Marine-Offizier eingebracht, den man
eigentlich auch als Sigourney Weaver alias Ripley ansehen kann, denn
sein Ausgangsszenario entspricht dem der Ripley aus Aliens - die R&uuml;ck
kehr (Alien 2) - wenn auch in leicht abgewandelter Form: Auch er erwacht
aus dem Tiefschlaf, ist aber allein und ohne jegliche Ausr&uuml;stung oder
Waffen den Au&szlig;erirdischen ausgesetzt. Seine Mission besteht darin, den
Selbstzerst&ouml;rungsmechanismus der &uuml;berfallenen Raumbasis zu aktivieren,
um dann mit Hilfe einer Rettungskapsel dem Inferno zu entfliehen. Er
kann mit Shotgun, Pulse Rifle, Flame Thrower oder Smart Gun bewaffnet
werden, zudem hilft ihm ein sogenannter Motion Tracker (wie bei Aliens)
bei der Aufsp&uuml;rung eventuell sich in der N&auml;he befindlicher Feinde. All
diese "Goodies" m&uuml;ssen aber zuerst einmal gefunden werden, genauso wie
Munition und Nahrung bzw. Medi-Kits, um die Lebensenergie aufzufrischen.
Mit diesen kann das Alien hingegen nichts anfangen. Die einzige M&ouml;glichkeit, ein (zu) fr&uuml;hes Ableben zu verhindern, ist f&uuml;r dieses Wesen, einen
auf spezielle Art get&ouml;teten Marine als Wirtsk&ouml;rper f&uuml;r einen "Facehugger"
zu mi&szlig;brauchen, welcher daraufhin zu einem vollwertigen Alien heranw&auml;chst
und praktisch als Zusatzleben zur Verf&uuml;gung steht. Dies braucht allerdings seine Zeit, und es k&ouml;nnen gleichzeitig nur drei Aliens "gez&uuml;chtet"
werden - 'erst nach dem vorangegangenen Tod des zur Zeit aktiven Aliens
kann der Nachfolger aus seinem Kokon schl&uuml;pfen und die Rettung der Queen,
die im Predator-Raumschiff festgehalten wird, fortsetzen. Zur Erf&uuml;llung
dieser Aufgabe steht es zwar nur mit seinen "naturgegebenen" F&auml;higkeiten
da, diese erweisen sich dennoch als &auml;u&szlig;erst wirksam: eine Klaue (leichter
Schaden), das Maul (absolut t&ouml;dlich) und der pfeilspitze Schwanz (hohe
Reichweite, "Einschleimen" des Gegners) heizen den Alien-Gegnern entsprechend ein, die hohe Fortbewegungsgeschwindigkeit unterstreicht selbiges.
Der Predator als zweitschnellster K&auml;mpfer des verfeindeten Trios kann den
Angriffen seiner Kontrahenten nicht unbedingt durch seine Schnelligkeit
entkommen, besitzt aber die wohl beste F&auml;higkeit in diesem Zusammenhang:
das Tarnen durch Unsichtbarkeit. In diesem Zustand kann leider nicht
get&ouml;tet werden, da der Predator an einen strengen Ehrenkodex gebunden
ist, der es ihm untersagt, auf feige Weise zu killen, er mu&szlig; seinem Feind
Auge in Auge gegen&uuml;berstehen. Im Spiel w&uuml;rde dies bei Nichtbeachtung mit
Punktabzug bestraft werden, was vordergr&uuml;ndig ja als verschmerzbar erscheint; ist es aber nicht, denn nur durch Punkte kann der Predator sein
Waffenarsenal erweitern. Er geht (sofern der Highscore dementsprechend
hoch ist) mit Handgelenksklinge, Speer, einer rasiermesserscharfen Frisbeescheibe und einer Schulterkanone auf die Jagd nach Ruhm und Ehre, welche seinen einzigen Antrieb f&uuml;r das m&ouml;rderische Unterfangen bilden. Als
Beweis seines Mutes hat er seinem Volk den Sch&auml;del der Alien-Queen zu
&uuml;berbringen, der sich dann in die Reihen der vielen anderen Troph&auml;en
dieser au&szlig;erirdischen Gattung einf&uuml;gen wird. Seine Nahrungs-/Erhaltungsgewohnheiten sind gleich denen des Marines, und auch er kann durch seinen Audio Waveform Analyser Gegner orten. Im Falle einer verschlossenen
T&uuml;r gibt es f&uuml;r ihn wie auch f&uuml;r das Alien keine Probleme: Sie existieren
bei der Wahl eines dieser Monster nicht. Der Marine hingegen mu&szlig; sich
durch die zahlreichen verwinkelt aufgebauten Luftschachtsysteme weiterbewegen oder sich auf gefundene Security-Cards verlassen, sofern sie mit
der passenden Nummer versehen sind. Selbstverst&auml;ndlich steht ihm auch der
(gef&auml;hrlichere und aufgrund der labyrinthartigen Anordnung mit vielen Verbindungen wesentlich kompliziertere) Weg durch die Luftsch&auml;chte frei.
Durch diese k&ouml;nnen auch andere Stockwerke erreicht werden (insgesamt 5),
wobei im ersten das Predatorschiff und im f&uuml;nften das Alienschiff mit
Queen (hier befindet sich auch die Rettungskapsel) angedockt ist. In der
dritten Etage startet der Marine, d.h. die K&auml;ltekammer ist hier vorzufinden. Der Startpunkt der beiden Au&szlig;erirdischen ist der jeweilige "Andocklevel" (siehe oben). F&uuml;r den Predator allerdings sind die Aufz&uuml;ge verpflichtend, da er nicht &uuml;ber die "Luftschacht-Alternative" verf&uuml;gen kann.
Zudem gibt es noch blockierte ("jammed") T&uuml;ren, die weder mit Security-Card, noch von Alien oder Predator durchschritten werden k&ouml;nnen. Hinter
selbigen verbirgt sich gl&uuml;cklicherweise nichts, was f&uuml;r den Predator von
Relevanz sein k&ouml;nnte, dennn die R&auml;ume dahinter k&ouml;nnen nicht durch Aufz&uuml;ge
erreicht werden, und dem Predator bietet sich ja wie beschrieben keine andere Alternative, eine T&uuml;r zu umgehen. Das Alien kann wie der Marine problemlos die Luftsch&auml;chte betreten.
<P>
Neben den drei Hauptdarstellern begegnen dem Spieler in den fl&uuml;ssig und
der Geschwindigkeit der gew&auml;hlten Spezies entspreched schnell scrollenden
3D-G&auml;ngen noch andere Lebensformen. Auf diese soll allerdings aus Motivationsgr&uuml;nden nicht n&auml;her eingegangen werden.
<P>
N&auml;her eingegangen werden mu&szlig; aber auf die superbe grafische und akustische
Pr&auml;sentation von Alien vs. Predator. Durch die gro&szlig;teils den Filmen entnommene digitalisierte Grafik und die gesampelten Soundeffekte/Hintergrundger&auml;usche entsteht eine absolut spannende, ja geradezu klaustrophobische Atmosph&auml;re, die dem Game ein besonderes Flair verleiht. Man f&uuml;hlt
sich unfreiwillig wie Ripley in Alien oder wie der Predator als Killermaschine. Auch die Situation des Aliens l&auml;&szlig;t sich bestens nachvollziehen.
So meuchelt man sich aus der Ich-Perspektive durchs Spielgeschehen, wobei
dem Marine zus&auml;tzlich w&auml;hrend des Spiels die Story entbl&auml;ttert wird. Dies
geschieht durch die verstreut installierten Computer-Terminals, an denen
man neben einer schematischen Darstellung der momentan sich in "Bearbeitung" befindlichen Etage noch Infos &uuml;ber Gegner (Aliens, Facehugger, Eier, Predators u.a.) und Waffen (siehe oben) abrufen kann. Au&szlig;erdem werden strategische Tips gegeben, im Medizin-Labor ist es sogar m&ouml;glich, verlorene Energie wieder aufzutanken (Entsprechend der aktuellen Security-Card, z.B. kann man mit Security-Card 5 nur bis zur 50%-Marke der Energieleiste auftanken. Falls man mehr als 50% Energie hat, ist ein Auftanken
'erst gar nicht m&ouml;glich). Stellt sich einem ein Gegner in den Weg, ist
schnelles Handeln vonn&ouml;ten. Mit den genannten Waffen der einzelnen K&auml;mpfer
l&auml;&szlig;t sich dem Feind mehr oder weniger Schaden zuf&uuml;gen, von den drei Hauptakteuren ist in diesem Kontext der Predator die widerstandsf&auml;higste Kreatur. Gelingt es einem, den Exitus des Gegen&uuml;bers zu verursachen, wird dies
nicht gerade zimperlich dargestellt: die Aliens zerplatzen mit einem lauten Kreischen und lassen eine lebensenergieraubende Schleimpf&uuml;tze zur&uuml;ck,
der Marine verabschiedet sich mit einem Schrei und einer blutigen Wunde
ins Jenseits, w&auml;hrenddessen der Predator grunzend zu Boden geht; Die Facehugger verscheiden hektisch zappelnd. Doch nicht nur die Todesszenen unterscheiden sich, auch die Darstellungsformen der G&auml;nge, Hallen und T&uuml;ren
sind zahlreich und verschieden. Man bewegt sich durch schleimige Alienwelten, verwirrend gelblich-braune Predatorzufluchten, diverse Raumschiffeinrichtungen und dergleichen mehr. Hin und wieder l&auml;uft man einem sich
im Reifungsstadium befindlichen Alien-Kokon &uuml;ber den Weg, der darin sich
befindliche Marine ist nur zu bedauern. Vorsicht ist geboten, wenn man ein
fertiges Ei findet: So manch einer ist schon dem pl&ouml;tzlich daraus schl&uuml;pfenden Facehugger zum Opfer gefallen. Teilweise l&auml;&szlig;t sich durch Fensterscheiben und Durchl&auml;sse in Wand und T&uuml;r eventuelles Unheil im Nachbarraum
aussp&auml;hen, doch meistens sieht man sich von den Angriffen &uuml;berrascht, sofern man nicht gerade den Marine verk&ouml;rpert und zuf&auml;llig noch den Motion
Tracker sein Eigen nennt. Hat man einen Angriff unter Kontrolle gebracht,
erweist sich die exakte Steuerung als gro&szlig;e Hilfe; m&uuml;helos bl&auml;st man dem
Agressor eine Ladung Schrot entgegen oder l&auml;&szlig;t sein mit nadelspitzen Z&auml;hnen bewehrtes Maul vorschnellen, um dem Gegner den Garaus zu machen. In
der Gegend herumstehende Benzinf&auml;sser zeigen sich dabei als a&uuml;&szlig;erst
hilfreich: einmal durch eine Attacke zur Detonation gebracht richten sie
einen nicht geringen Schaden an, weswegen man sich nach erfolgtem
Ausl&ouml;sen tunlichst in Sicherheit bringen sollte, denn auch Kettenreaktionen hintereinanderstehender F&auml;sser sind keine Seltenheit und verursachen
Schaden betr&auml;chtlichen Ausma&szlig;es: ein wahres Feuerwerk. Weiterhin kann man
sich hinter Holzkisten vor Aliens verschanzen, vor den Schu&szlig;waffen von
Marine und Predator bietet dies logischerweise keinen Schutz.
<P>
Genauso wie die Holzkisten keinen gro&szlig;en Schutz bieten, k&ouml;nnen sich auch
die ID-Games nicht irgendwo vor der erschlagenden Power der Filmgiganten
verstecken. Digitalisierte Grafik, Hintergrundger&auml;usche (der Predator k&uuml;ndigt von seiner eventuell unsichtbaren Anwesenheit durch Fl&uuml;stern und
Knurren - einfach irre !!), wahnsinnig umfangreiche, ausgekl&uuml;gelte Level
und nicht zuletzt die unschlagbare Atmosph&auml;re sprechen neben einigen anderen Pluspunkten ein klares Machtwort: PC, SNES, MegaDrive und wie sie
alle hei&szlig;en: Ab in die Ecke, zu Weihnachten Jaguar und Alien vs. Predator
kaufen, sich ausreichend mit Chips- und Colavorr&auml;ten eindecken, die Haust&uuml;r abschlie&szlig;en und wegspacen; in die unendlichen Weiten des 64-Bit Weltalls, die niemals ein Mensch zuvor sah... Endlich ein Jaguarspiel, das
die Kiste auch 'mal ausnutzt und die Muskeln spielen l&auml;&szlig;t. Vom Prinzip
zwar nicht revolution&auml;r, aber ansonsten echt klasse. Wenn man nur an das
tolle Automapping und die Overlay-Statusanzeige denkt... Zuguterletzt
lassen sich sogar (absolut notwendig) drei Spielst&auml;nde und die Highscore
abspeichern. Abspeichern m&ouml;chten an dieser Stelle auch wir. Hoffentlich
geht es so mit dem Jaguar weiter; hoffentlich halten kommende Spiele wie
beispielsweise Kasumi Ninja, Iron Soldier (Gru&szlig; an Marc Rosocha), Rayman
etc., die bis Weihnachten released sein wollen, was sie versprechen und
liefern erneut Kaufgr&uuml;nde f&uuml;r die Raubkatze...
<P>
<B>Wertung:</B>
<P>
<TABLE border width=50 align=center>
<TR>
<TH>Grafik<TD align=center>90%
<TR>
<TH>Sound<TD align=center>75%
<TR>
<TH>Spielspa&szlig;<TD align=center>90%
</TABLE>


<HR>
</BODY>

</HTML>
