<HTML>

<HEAD>
<!-- erstellt: 07.05.1996 10:34:08 -->
<TITLE>Brutal Sports Football</TITLE>
</HEAD>

<BODY>
<H1>Brutal Sports Football</H1>
<HR><H3>SPLATTER-SPORTS</H3>
<P>
Uargh !! Blut spritzt literweise &uuml;ber das Bild... hehe !! Noch einer
meiner Gegner hat den Kopf verloren !! Ohne Skrupel l&auml;&szlig;t Telegames
die absolute Brutaloorgie auf die ausgehungerten Jaguar-Freaks los.
Und glaubt mir - hier werdet Ihr satt werden !!
<P>
Also, drehen wir die Uhr vor ins Jahr 2034 - Tatort: ein ganz normales Football-Feld; T&auml;ter bzw. Opfer: kaum normale Gen-Mutanten.
Bis dahin sieht das ganze verdammt nach Speedball, M.U.D.S. und
&auml;hnlichen P&ouml;beleien aus. Doch pl&ouml;tzlich wird mein Auge von Kaskaden roten Saftes &uuml;berrascht. Geile Sauerei !! Ich nehme den Kopf
meines kurz zuvor noch lebendigen Gegenspielers und kicke ihn mit
einem gewaltigen Tritt quer &uuml;ber das Spielfeld (mensch, da bekommt man ja richtig nostalgische Gef&uuml;hle, wie in alten 64er-
Schlarbarian-Zeiten). Durch weitere Fiesematenten meinerseits beschere ich dem computergesteuerten Gegenspieler einen Haufen &Auml;rger, indem ich Bomben auf dem Platz umherschmei&szlig;e, Speed-Ups einsammle und mit Schwert und Schild bewaffnet auf seine Spieler einpr&uuml;gle. Nach l&auml;ngerer Behandlung dieser mit genannten Methoden tritt
dann auch schlie&szlig;lich das in der Einleitung beschriebene Ereignis
ein... FREI AB 18 - psychische Sch&auml;den nicht ausgeschlossen.
<P>
Ihr seht, hier geht es nicht gerade zimperlich zu - aber ich hoffe,
Ihr versteht die oberen Zeilen nicht falsch, denn (nur f&uuml;r den Fall,
da&szlig; sich 'mal wieder jemand auf den Schlips getreten f&uuml;hlt) wir sind
keine Gewaltbef&uuml;rworter. Diesen Eindruck hat man allerdings nicht
von den Programmierern dieses auch zu zweit spielbaren Gemetzels:
Die Grafik ist zwar nichts Besonderes (besseres SNES-Niveau), doch
im wahrsten Sinne des Wortes einschl&auml;gige Szenen werden in indizierungsausreichender Pracht pr&auml;sentiert. Der Sound d&uuml;mpelt so vor sich
hin, f&auml;llt aber nicht negativ aus dem Rahmen. Im Spiel stehen Euch
folgende M&ouml;glichkeiten offen: ohne Ball k&ouml;nnt Ihr entweder
Eurem Gegner in die Hacken springen, ihn mit der Faust bzw. dem
jeweiligen Extra maltr&auml;tieren, oder auf ihm herumtrampeln, nachdem
Ihr ihn niedergeschlagen habt; dies alles dient nat&uuml;rlich der Erlangung des "Ei"s, w&auml;hrenddessen Ihr im Besitz des selbigen entweder
passen oder es in hohem Bogen wegkicken k&ouml;nnt. Nach kurzer Eingew&ouml;hnungsphase funktioniert dies alles auch recht gut, doch das Spektrum
der Optionen reicht wie bei Speedball noch &uuml;ber das eigentliche Geschehen auf dem Spielfeld hinaus. So k&ouml;nnt Ihr (genug Bares durch
K&ouml;pfungen oder Tore vorausgesetzt) nach einem Match Eure Haudegen
heilen, mit gr&ouml;&szlig;erer Geschwindigkeit segnen oder im Todesfalle wiederbeleben. Dies ist leider schon alles, weitere M&ouml;glichkeiten w&auml;ren an dieser Stelle w&uuml;nschenswert gewesen. Gl&uuml;cklicherweise wird
hierdurch die Motivation kaum getr&uuml;bt, lediglich das ruckelige
Scrolling (was m&ouml;glicherweise am Erstellen des Games auf einer 50Hz-Kiste liegt; wir testeten auf 60Hz) k&ouml;nnte diesen Effekt verursachen.
Abgerundet wird das ganze durch einen Liga- Knockout- und sogenannten
Unfriendly-Modus, wobei, wie schon gesagt, auch Freund oder Feind als
zweiter Mitstreiter am Jaguar Platz nehmen kann.
<P>
Unserer Meinung nach h&auml;tte der brutale Spa&szlig; jedoch weitaus besser programmiert werden k&ouml;nnen, auch Grafik und Sound werden (wie bisher fast
immer geschehen) den Jaguar-F&auml;higkeiten keineswegs gerecht. Aber die
Motivation und der Spa&szlig; stimmen, so da&szlig; nat&uuml;rlich auch wegen des immer
noch vorherrschenden Modulmangels eine Kaufempfehlung ausgesprochen werden kann, ohne allerdings aufgrund oben genannter Punkte den moralischen
Stinkefinger zu erheben - nichts f&uuml;r "Weicheier".
<P>
<B>Wertung:</B>
<P>
<TABLE align=center width=50 border>
<TR>
<TH>Grafik<TD align=center>60%
<TR>
<TH>Sound<TD align=center>50%
<TR>
<TH>Spielspa&szlig;<TD align=center>60%
</TABLE>

<HR>
</BODY>

</HTML>
