<HTML>

<HEAD>
<!-- erstellt: 07.05.1996 10:42:31 -->
<TITLE>Bubsy</TITLE>
</HEAD>

<BODY>
<H1>Bubsy</H1>
<HR>
<H3>FERTIGGERICHT 1</H3>
<P>

Ein komplett neues Spiel pr&auml;sentiert uns Imagitec Design anstelle einer
einfachen Konvertierung. Doch schon die SNES- und MD-Versionen dieses
Jump'n'Runs konnten nicht 100%ig &uuml;berzeugen. Ist die JAG-Version die
gro&szlig;e Ausnahme ?
<P>
Wie schon gesagt, auf dem Jaguar hat Bubsy mit den anderen Versionen bis
auf den Namen und das Spielprinzip nicht mehr viel zu tun: neue Grafik,
anderer Levelaufbau, schlechter Sound. Schlechter Sound ? Ja, den Soundtrack m&ouml;chte ich nicht unbedingt als "neu" oder "anders" beschreiben, denn
er ist nach wie vor nicht sonderlich gut. Selbiges gilt an und f&uuml;r sich
auch f&uuml;r die Grafik, denn diese ist zwar neu, das hei&szlig;t aber nicht, da&szlig;
Euch jetzt der šberhammer erwartet. Es sind zwar teilweise ganz nette
"Rendereien" vorzufinden, doch diese t&auml;uschen nicht &uuml;ber den durchschnittlichen grafischen Gesamteindruck weg. Dem Levelaufbau kann man eine eindeutige Geradlinigkeit vorwerfen, die zeitweise einen gewissen G&auml;hneffekt
beim Spieler verursacht. So kommt man zu dem Res&uuml;mee, da&szlig; sich hinter eingangs erw&auml;hnten Unterschieden zu den anderen Konsolen eigentlich nicht
viel verbirgt. Prinzipiell kann man n&auml;mlich weder von Verbesserungen, noch
von &Auml;nderungen zum Schlechten hin sprechen: Bubsy bleibt eben Bubsy. Wer's
schon auf SNES und MD mochte, wird auch hier seine Freude haben, denn es
wird ja Bubsy in &auml;u&szlig;erlich leicht modifizierter Form geboten, die aber dem
JAG 'mal wieder nicht gerecht wird. F&uuml;r popliges 2-3 Ebenen-Scrolling brauche ich keine 64-Bit, genausowenig wie f&uuml;r 'n paar gerenderte Viecher, die
zudem auch nicht &uuml;berm&auml;&szlig;ig animiert sind. Wer es noch 'ne Weile ohne
Jump'n'Run aushalten kann, sollte auf Rayman warten. Und Atari sollte das
Geld lieber in neue Projekte stecken, anstatt olle 16-Bit-Kamellen wieder
aufzuw&auml;rmen bzw. aufw&auml;rmen zu lassen, noch dazu in JAG-ungerechter Weise.
M&ouml;chte n&auml;mlich nicht wissen, wie hoch die Lizenzzahlungen an Accolade gewesen sind.
<P>
<B>Wertung:</B>
<P>
<TABLE align=center width=50 border>
<TR>
<TH>Grafik<TD align=center>65%
<TR>
<TH>Sound<TD align=center>60%
<TR>
<TH>Spielspa&szlig;<TD align=center>55%
</TABLE>

<HR>
</BODY>

</HTML>
