<HTML>

<HEAD>
<!-- erstellt: 07.05.1996 10:49:13 -->
<TITLE>Checkered Flag</TITLE>
</HEAD>

<BODY>
<H1>Checkered Flag</H1>
<HR>
<H3>DAS 64-BIT VIRTUA RACING F&Uuml;R DEN JAGUAR?</H3>
<P>
Checkered Flag ist das zweite Spiel aus dem Hause Rebellion nach dem
Tophit Alien vs. Predator, nur was wollten die Programmierer mit diesem
Spiel uns sagen?
<P>
Checkered Flag verf&uuml;gt &uuml;ber eine relativ flotte Vektorgrafik und nette
Musik- und Soundeffekten, 10 verschiedenen Rennstrecken und einigen
Options wie z.B. Wetter (Sommer, Regen, Nebel), Reifensort, Heckspoiler,
manuelles oder automatisches Getriebe usw. ...<P>
Am startet also die ganz stolz auf seine 64-Bit Konsole erste Probefahrt
und alles l&auml;uft am Schn&uuml;rchen, wenn da nicht dieses doofe Kurvenfeeling
w&auml;re... Das Fahrverhalten ist einfach derartig unpr&auml;zise, da&szlig; man selbst
nach tagelanger Praxis immer noch gerne das Modul/Pad, oder den Programmierer der f&uuml;r diese beschissene Steuerung zust&auml;ndig ist, an die Wand zu
klatschen... Der gr&ouml;;&szlig;te Witz sind die Computergegner, die in den Kurven
wie die Henker rasen und immer in der Mitte ohne aus der Bahn getragen
zu werden und dann in den Geraden wie die Schnecken daherschlurfen.<P>
Wird man gar von einem Computergegner mal geramt f&auml;hrt dieser mit
Fullspeed vorbei, als wenn gar nichts geschehen w&auml;re und unser Rennauto
&uuml;berschl&auml;gt sich und mu&szlig; wieder bei 0 km/h anfangen, so da&szlig; die nachfolgenden Computergegner einen auch &uuml;berholen und wom&ouml;;glich wieder ramen...
<P>
<B>Fazit:</B>
<P>
Alle Rennspiel-Freaks die mehr mit der Steuerung zu k&auml;mpfen haben wollen
als mit dem gegnerischen Wagen sollten vor einen Kauf Probespielen,
alle anderen d&uuml;rfen auf dem n&auml;chsten Rennspielversuch warten...
<P>
<B>Bewertung:</B>
<P>
<TABLE width=50 align=center border>
<TR>
<TH>Grafik<TD align=center>70%
<TR>
<TH>Sound<TD align=center>65%
<TR>
<TH>Spielspa&szlig;<TD align=center>60%
</TABLE>

<HR>
</BODY>

</HTML>
