<HTML>

<HEAD>
<!-- erstellt: 07.05.1996 11:11:22 -->
<TITLE>Crescent Galaxy</TITLE>
</HEAD>

<BODY>
<H1>Crescent Galaxy</H1>
<HR>
<H3>CRAZY GALAXY</H3>
<P ALIGN=justify>
Das 2. Spiel f&uuml;r Atari's Jaguar &uuml;berrascht mit einer bisher noch
nicht in einem Ballerspiel gesehenen Grafik !! K&ouml;nnen auch die
weiteren Eigenschaften &uuml;berzeugen ?
<P ALIGN=justify>
Wie nicht anders zu erwarten, gl&auml;nzt die Story wie f&uuml;r ein
Shoot `em Up &uuml;blich mit ergreifender Einfallslosigkeit. Diesmal
ist es Odd-It, der die Welt, hier die Crescent Galaxy, bedroht. Ihr
st&uuml;rzt Euch also als Trevor McFur mit Euerem Kumpel Cutter, der als
eine &uuml;ber das Joypad zu aktivierende Extrawaffe zur Verf&uuml;gung steht,
in den Kampf, den Ihr nur f&uuml;r Euch entscheiden k&ouml;nnt, wenn Ihr
Odd-It's Hauptbasis auf dem Planeten Cosmolite zerst&ouml;rt. Dieser ist
allerdings nur nach Vernichtung der Endgegner der ersten vier Planeten zu erreichen. Bevor man jedoch auf dem jeweiligen Stern seine
Arbeit verrichten kann, gilt es, den Anflug dorthin zu meistern,
an dessen Ende auch noch ein besonders fetter Brocken auf Euch wartet. Im Endeffekt ergibt dies also 10 Obermotze, die allesamt super
in Szene gesetzt wurden, z.B. erwarten Euch ein "Swamp Thing", einige total abgespacete Gen-Mutationen und weitere "Beknacktheiten".
Aber auch die "Kleinen" sind nicht von schlechten Eltern. So haben
es sonnenbebrillte Engelchen mit B&ouml;gen (??), Riesenskorpione, h&uuml;pfende
Aug&auml;pfel und anderes Viehzeugs auf Euch abgesehen. Teilweise k&ouml;nnten
einige der Gegner der Phantasie eines "Parodius"-Grafikers entsprungen
sein. Um solche nun fachgerecht zu "entsorgen", steht Euch ein breitgef&auml;chertes Extrawaffenarsenal &uuml;ber das Joypad (das auch hier durch eine
mitgelieferte Schablone aufgepeppt wird) zur Verf&uuml;gung, das neben Shields,
Laserstrahlen, Smart Bombs usw. sogar einen Magneten beinhaltet, der
bei Aktivierung alle auf dem Bild befindlichen Objekte an sich zieht,
um diese zu zerst&ouml;ren. Ihr seht also, vom Einfallsreichtum (bis auf
die Story) her gibt es nichts zu bem&auml;ngeln. Doch leider kann man dies
nicht vom Sound sagen, da dieser wirklich mies ist. Ein mehr schlecht
als recht  `hingeschluderter Titelsound gepaart mit unterdurchschnittlichen Effekten hinterl&auml;&szlig;t an dieser Stelle einen faden Beigeschmack
(warum drei (!) Leute f&uuml;r so einen Sound ?!), den die wirklich hervorragende Grafik bedauerlicherweise nicht ganz ausmerzen kann, da sie
zwar super gezeichnet und animiert ist, jedoch im Hintergrund durch
oftmalige Wiederholung von bereits Gezeigtem wenig Abwechslung bietet.
Selbiges gilt auch f&uuml;r die weitere Gestaltung des Spiels, denn mehr
als Zwei-Ebenen-Parallax-Scrolling wird nicht geboten, zudem wiederholen sich auch die Gegner zu oft. Doch ist man noch nie zuhause oder
in der Spielhalle durch solch faszinierende Landschaften geflogen,
womit Crescent Galaxy f&uuml;r Ballerspielfans trotz aller oben genannten
M&auml;ngel empfehlenswert bleibt. F&uuml;r Jaguarbesitzer bietet sich mangels
momentaner Auswahl sowieso keine andere Alternative, hier werden
die M&ouml;glichkeiten der Raubkatze in grafischer Hinsicht wenigstens ansatzweise gezeigt. Wertungsm&auml;&szlig;ig versuchen wir, es am 64-Bit-Standard
zu messen, wobei dies von technischer Seite gesehen sehr schwer ist,
da z.Zt. Vergleichsm&ouml;glichkeiten fehlen. Vom derzeitigen 16-Bit-Standard her ist die Grafik sensationell, der Sound l&auml;&szlig;t arg zu w&uuml;nschen &uuml;brig. Spielablauf und Dauerspa&szlig; bewerten wir nat&uuml;rlich wie
&uuml;blich, da diese Punkte ja nicht von der Bit-Zahl eines Systems abh&auml;ngen.
<P>
<B>Bewertung:</B>
<P>

<TABLE WIDTH=50% ALIGN=center BORDER>
<TR>
<TH>Grafik</TD>
<TD ALIGN=center>80 %</TD>
</TR>
<TR>
<TH>Sound</TD>
<TD ALIGN=center>10 %</TD>
</TR>
<TR>
<TH>Spielspa&szlig;</TD>
<TD ALIGN=center>40 %</TD>
</TR>
</TABLE>


<HR>
Zuletzt geändert: Tuesday, 7. May 1996
</BODY>

</HTML>
