<HTML>

<HEAD>
<!-- erstellt: 07.05.1996 11:22:43 -->
<TITLE>Cybermorph</TITLE>
</HEAD>

<BODY>
<H1>Cybermorph</H1>
<HR>
<H3>MORPH, MORPH !!</H3>

<P ALIGN=justify>
Endlich ist es da !! Das erste Spiel f&uuml;r Atari's Jaguar liegt sofort
dem Grundger&auml;t bei. Mit schattierter 3D-Vektorgrafik versucht Atari,
die Freaks zu begeistern und die Konkurrenz alt aussehen zu lassen.
<P ALIGN=justify>
"The Galactic War has begun..." - Storym&auml;&szlig;ig bietet Cybermorph
wirklich nichts Neues. Die Aufgabe des Spielers ist folglich, wieder
einmal das Universum von einer b&ouml;sen Macht (hier das Pernitia Empire)
zu befreien und den Frieden wieder herzustellen. Um dies zu erreichen,
mu&szlig; in insgesamt 5 Galaxien mit jeweils 8 Planeten, sprich Levels,
eine bestimmte Anzahl von sogenannten PODs aufgesammelt werden, woran
man durch eine nicht gerade kleine Gegnerschaft (u.a. X-Wing-&auml;hnliche
Gleiter, Energiefelder, Kamikaze-J&auml;ger, Bodenschu&szlig;anlagen etc.) gehindert werden soll. Um dieser etwas entgegensetzen zu k&ouml;nnen, ist das
eigene Raumschiff mit speziellen Flugf&auml;higkeiten ausgestattet. Wie
selten zuvor, kann man hier z.B. mit hoher Geschwindigkeit &uuml;ber den
Boden gleiten, dies sogar r&uuml;ckw&auml;rts (!). Selbstverst&auml;ndlich ist es
auch m&ouml;glich, sich in die Luft zu erheben, um dem Pernitia Empire ordentlich einzuheizen, wobei ein Fadenkreuz zur besseren Treffsicherheit &uuml;ber die Zw&ouml;lfertastatur des volumin&ouml;sen 17-Kn&ouml;pfe-Joypad hinzugeschaltet werden kann. &Uuml;ber diese Tastatur aktiviert man mit Hilfe
des Cybermorph beiliegenden Overlays auch die zahlreichen Extrawaffen
des Spiels, beispielsweise Smart-Bombs, Minen, Drei-Wege-Schu&szlig; usw. Weiterhin gibt Euch Skylar, ein "holographischer" eingebauter Co-Pilot
durch Sprachausgabe Informationen ("Port (Levelausgang) now open.") und
l&auml;&szlig;t dumme Kommentare los ("Where did YOU learn to fly ?!"). Nat&uuml;rlich
fehlen auch "gew&ouml;hnliche" Bonusgegenst&auml;nde wie PowerUps nicht. Man
flitzt also in dieser wirklich tollen und vor allem schnellen Grafik
&uuml;ber die Planeten, wobei das Zockererauge in sp&auml;teren Stufen von vielf&auml;ltigen Spieldetails &uuml;berrascht wird, die reine Actiongames wie z.B.
Starfox (SNES) oder Silpheed (MDCD) schon ein bi&szlig;chen schlechter aussehen lassen. Es ist m&ouml;glich, Teleporter zu benutzen, die in normalerweise
unerreichbare T&auml;ler f&uuml;hren, es gibt allesverschlingende B&auml;ume, die den
Boden mit schwarzer Farbe &uuml;berziehen, was in Verbindung mit der Farbenvielfalt des Games einen tollen Effekt ergibt, Kraftgeneratoren und
Radar- bzw. St&ouml;rsender (die Euren Radarscreen ausser Kraft setzen)
m&uuml;ssen aufgesp&uuml;rt und zerst&ouml;rt werden; der Spielumfang bietet gen&uuml;gend
Stoff f&uuml;r ein paar Wochen. Nur Endgegnerm&auml;&szlig;ig hat ATD ein wenig bei der
Konkurrenz geklaut, besonders Starfox l&auml;&szlig;t an dieser Stelle gr&uuml;&szlig;en.
Doch dies kann man aufgrund der anderen Spielelemente verschmerzen, da
auch die Spielbarkeit keineswegs zur&uuml;cksteht, sondern aufgrund der logisch-komfortablen Steuerung ihren Anteil zur G&uuml;te dieses Jaguar-Erstlings beitr&auml;gt (man mu&szlig; sich allerdings `erst an das zugegebenerma&szlig;en
anfangs recht klobig erscheinende Joypad gew&ouml;hnen). Technisch und spielerisch haut es einen zwar nicht vom Hocker (&uuml;berraschenderweise ist
der Sound &auml;u&szlig;erst schwach, die Soundeffekte bewegen sich auf Durchschnittsniveau), dennoch ist es besonders am derzeitigen 16-Bit-Standard
gemessen ein empfehlenswertes Spiel, das das Potential des Jaguars
allerdings nur leicht andeutet. Comanche z.B. kann in technischer Hinsicht Cybermorph durchaus Paroli bieten, doch ein Jaguar ist hardwarem&auml;&szlig;ig klar besser als ein 486er DX2-66 Mhz PC (ich h&ouml;r' jetzt schon die
PC-User schreien...). So bezieht sich auch die Wertung auf 64-Bit-Niveau,
wobei ich sogar meine, da&szlig; sie in diesem Zusammenhang zumindest in technischer Hinsicht noch zu hoch gegriffen ist, da 64 Bit zur Zeit noch ungeahnte M&ouml;glichkeiten bieten, die durch CD-ROM (bald auch f&uuml;r den Jaguar)
noch h&ouml;here Dimensionen erreichen k&ouml;nnen. Abschlie&szlig;end w&auml;re zu bemerken,
da&szlig; Cybermorph zwar kein Kaufgrund f&uuml;r den Jaguar ist, aber immerhin ein
guter Anfang. Der zweite Teil namens Cybermorph II - Battlemorph ist
derzeit schon in Arbeit, man darf gespannt sein.
<P>
<B>Bewertung:</B>
<P>
<TABLE ALIGN=center BORDER width=50>
<TR>
<TH>Grafik<TD ALIGN=center>70%
<TR>
<TH>Sound<TD ALIGN=center>50%
<TR>
<TH>Spielspa&szlig;<TD ALIGN=center>70%
</TABLE>

<HR>
</BODY>

</HTML>
