<HTML>

<HEAD>
<!-- erstellt: 07.05.1996 11:32:43 -->
<TITLE>Doom</TITLE>
</HEAD>

<BODY>
<H1>Doom</H1>
<HR>
<H2>R&Ouml;CHEL, MATSCH, SPLATTER, URGS !!!</H2>
<P ALIGN=justify>
Yes, Sir !! Doom ist endlich da !! Verteufelt und verg&ouml;ttert zugleich kann
auch endlich der Jaguar-Metzger das Ticket in die Schlachterei erwerben.
Mit den besten W&uuml;nschen der BPS entern wir die Verliese des Wolfenstein-Nachfolgers.
<P ALIGN=justify>
Eingangs w&auml;re zu bemerken, da&szlig; es modultechnisch bedingt einige kleine &Auml;nderungen gegen&uuml;ber der allseits bekannten PC-Version gibt: Zum einen sind
die Texturen auf dem Jaguar nicht ganz so detailliert wie auf dem PC, zum
anderen wurden die Endgegner teilweise weggelassen. Weniger ins Gewicht
f&auml;llt das Fehlen der Hintergrundmusik sowie der Wegfall der Karte, die
einem zwischen den einzelnen Abschnitten die Position anzeigt. All diese
"Beschneidungen" sind aber nicht auf die mangelnde Performance des Jaguar
zur&uuml;ckzuf&uuml;hren, sondern auf den begrenzten Speicher des Moduls (32 MBit =
4 MByte). Angesprochene Performance zeigt der Jaguar n&auml;mlich nur allzu deutlich: Von der Geschwindigkeit her h&auml;lt er locker mit einem 486 DX 66/2 mit,
und der PC-Pixelz&auml;hlerei kann man dank Cray-Modus ade sagen. Die Soundeffekte kommen klar und deutlich 'r&uuml;ber, und auch bez&uuml;glich der Musikst&uuml;cke in den jeweiligen Level-Info-Screens (Uff !!) hat man sich nicht lumpen
lassen. Selbiges gilt f&uuml;r den Levelaufbau: Dieser wurde exklusiv f&uuml;r die
Jaguar-Version &uuml;berarbeitet, undzwar mit dem Ergebnis, da&szlig; viele Passagen
nun weitaus komplexer und vertrackter daherkommen, als auf dem PC, der daf&uuml;r
leider ein paar Stufen mehr bietet. Zus&auml;tzlich hat die Jaguar-Fassung aber
zwei Bonuslevels. Neben dem Jaguar-Release von Doom ist auch noch die 32X-Fassung erschienen, welche die schlechteste der momentan verf&uuml;gbaren Versionen darstellt. Nur 17 Levels (Jaguar 25), fehlende Speicherm&ouml;glichkeit,
kleineres Bild (Jaguar Fullscreen-Darstellung) und niedrigere Detailstufe
lassen Sega's Version bla&szlig; aussehen. Au&szlig;erdem fehlt die 2 Spieler-Option, die
ID-Software gl&uuml;cklicherweise mit in die Jaguar-Version hat einflie&szlig;en lassen,
denn sie erweist sich als bedeutender Spielspa&szlig;-Multiplikator. Es ist die
absolute H&ouml;lle, sich mit einem zweiten Spieler in den Doom-Kavernen zu
messen. Sofern man in getrennten R&auml;umen auf die Jagd nach dem Mitspieler
geht, entsteht eine absolut klaustrophobische Atmosph&auml;re, wenn man das MG-Geratter des "Feindes" in der N&auml;he h&ouml;rt. Hinter jeder Ecke k&ouml;nnte der jeweils andere lauern und einem eine ordentliche Salve verpassen. Anscheinend blieb ID leider nicht gen&uuml;gend Zeit, um den Netzwerkbetrieb zu vervollkommnen, da hin und wieder ein Netzwerkfehler auftritt, woraufhin man
von vorn mit der Jagd beginnen mu&szlig;. Es gibt nat&uuml;rlich auch die M&ouml;glichkeit,
mit einem Mitspieler im Teamwork auf Monstersafari zu gehen, was auch ein
H&ouml;chstma&szlig; an Spa&szlig; garantiert. Zum Spiel an sich mu&szlig;, denke ich, eigentlich
nicht mehr viel gesagt werden (siehe &Uuml;berschrift). Man mu&szlig; f&ouml;rmlich eine
Kaufempfehlung aussprechen, wobei ich auf das absolut gute Preis/Leistungsverh&auml;ltnis zum PC aufmerksam machen m&ouml;chte: Noch bis vor kurzem mu&szlig;te man,
um Doom vern&uuml;nftig spielen zu k&ouml;nnen, 2-3000 DM investieren, und jetzt
gibt es den ganzen Spa&szlig; in seiner vollen Pracht (die jeweiligen Vor- und
Nachteile der PC- und Jaguar-Version wiegen sich gegenseitig auf) auf einer
500,- DM Konsole. Kommentar &uuml;berfl&uuml;ssig. Abschlie&szlig;end w&auml;re anzumerken, da&szlig;
ich mich bewu&szlig;t nicht als Moralapostel aufgespielt habe, da dies meiner
Meinung nach schon genug Leute vor mir getan haben. Ich kann auf jeden Fall
zwischen Spiel und Realit&auml;t unterscheiden und m&ouml;chte niemandem ab einem gewissen Alter unterstellen bzw. fast schon vorschreiben, dies nicht zu
k&ouml;nnen. In diesem Sinne immer ein volles Magazin in der Knarre und hoffentlich ein ertragreiches 1995 f&uuml;r den Jaguar.
<P>
<TABLE>
<TR>
<TH>Hinweis zum Netzwerk
<TD>Das Netzwerk l&auml;uft nur einigermassen stabil
 (ca. 20 bis 50 Minuten) bei zwei PAL- oder zwei
                    NTSC-Jaguars!! Ein Umbau hilft hier NICHT!!
                  NTSC-Jaguars mit PAL-Jaguars zu koppeln ist
           sinnlos, da das Netzwerk alle 10 Sekunden abs&auml;uft.
                 Auch l&auml;uft Doom NICHT auf den ersten PAL-Jaguar,
                 die ab M&auml;rz in Deutschland &uuml;ber Quelle verkauft
                   wurden.
</TABLE>
<P>
<B>Wertung:</B>
<TABLE ALIGN=center BORDER width=50>
<TR>
<TH>Grafik<TD ALIGN=center>85 %
<TR>
<TH>Sound<TD ALIGN=center>60 %
<TR>
<TH>Spielspa&szlig;<TD ALIGN=center>95 %
</TABLE>

<HR>
</BODY>

</HTML>
