<HTML>

<HEAD>
<!-- erstellt: 07.05.1996 11:45:25 -->
<TITLE>Dragon - The Bruce Lee Story</TITLE>
</HEAD>

<BODY>
<H1>Dragon - The Bruce Lee Story</H1>
<HR>
<H2>KIAI !!</H2>

<P ALIGN=justify>
Die Legende kehrt zur&uuml;ck !! Nach SNES und MD beehrt uns Bruce Lee auch auf
dem JAG. Und man lie&szlig; es sich diesmal nicht nehmen, ihn einigerma&szlig;en
gerecht den Freaks zu pr&auml;sentieren; n&auml;mlich in der besten bisher erschienenen Version.
<P ALIGN=justify>
Ich f&uuml;hle mich wie "Der Mann mit der Todeskralle". Mit wilden Tritt- und
Schlagkombinationen pr&uuml;gele ich auf mein Gegen&uuml;ber ein. Dann ist meine
Ki-Power hoch genug, und ich zaubere ein Nunchaku hervor, womit ich den
Kampf kurz und schmerzhaft beende, nachdem ich zuvor im Fighter-Modus (Bruce
wird extrem schnell) schon gut hingelangt habe. Danach folgt ein Training
am h&ouml;lzernen Mann, und ich f&uuml;hle mich fit f&uuml;r den n&auml;chsten Kontrahenten.
So k&ouml;nnte man den Spielablauf von Dragon - The Bruce Lee Story beschreiben.
<P ALIGN=justify>
Dem Spieler wird eine relativ gro&szlig;e Auswahl an Schl&auml;gen und Tritten geboten, was auch auf die Anzahl der Spielmodi zutrifft. 1Player-Mode, 2Player-versus-Mode und 2Player-versus-Computer-Mode versprechen auch f&uuml;r einen
Freund &uuml;berdurchschnittlichen Pr&uuml;gelspa&szlig;. Die Musik gibt sich fern&ouml;stlich,
noch dazu in guter kompositorischer und klanglicher Qualit&auml;t. Grafisch
schlie&szlig;t sich das Game hier an, es kommt durchaus fern&ouml;stliche Stimmung
auf, und auch die Gegnerauswahl, die der gleichnamigen Lebensverfilmung
von Bruce Lee und einigen seiner eigenen Filme entnommen ist, kann &uuml;berzeugen. Man mu&szlig; sogar gegen den b&ouml;sen D&auml;monen antreten, der Bruce laut
Filmvorlage ums Leben gebracht hat, antreten, nachdem man selbst ausgeknockt worden ist und keine weiteren Continues mehr &uuml;brig hat. Besiegt man
diesen, darf man bis zum n&auml;chsten Exitus weiterspielen, und die gesamte
Prozedur beginnt erneut. Ein wenig &Uuml;bung vorausgesetzt, hat man also praktisch unendliche Continues. &Uuml;bung ist auch vonn&ouml;ten, denn Dragon gestaltet
sich nicht gerade als einfach. Zudem gelangt man 'erst ab einem gewissen
Schwierigkeitsgrad zum wirklich allerletzten Gegner.
<P ALIGN=justify>
Das Spiel kann zwar nicht mit den momentanen Blockbustern Super Street
Fighter 2 Turbo und Mortal Kombat 2 mithalten, bietet hingegen allerdings
klassischen Pr&uuml;gelspa&szlig; 'mal ohne irgendwelche aus der Luft gegriffenen
MegaHyperSuperDuper-SpecialBrutalo-Moves. F&uuml;r JAG-Freaks uneingeschr&auml;nkt
zu empfehlen und f&uuml;r Bruce Lee-Fans sowieso. Lust auf eine "nette" Tracht
Pr&uuml;gel hat man hin und wieder n&auml;mlich auf jeden Fall, im 2Player-Mode garantiert. Holt Euch den "Magier des Kung Fu" ins Haus !!
<P>
<B>Wertung:</B>
<P>
<TABLE ALIGN=center BORDER width=50>
<TR>
<TH>Grafik<TD ALIGN=center>75 %
<TR>
<TH>Sound<TD ALIGN=center>70 %
<TR>
<TH>Spielspa&szlig;<TD ALIGN=center>75 %
</TABLE>

<HR>
</BODY>

</HTML>
