<HTML>

<HEAD>
<!-- erstellt: 07.05.1996 12:03:58 -->
<TITLE>Iron Soldier</TITLE>
</HEAD>

<BODY>
<H1>Iron Soldier</H1>
<HR>
<P ALIGN=justify>
So, heute habe ich Iron Soldier bekommen. Ist ein verdammt gutes Spiel und
man merkt, da&szlig; sich die Programmierer (Hallo Marc) wirklich viel M&uuml;he
gegeben haben.
<P ALIGN=justify>
Das Spiel umfa&szlig;t 16 Missionen. Anfangs kann man nur aus vier Missionen
eine ausw&auml;hlen. Die n&auml;chsten vier erreicht man erst, wenn die vorherigen
vier abgehakt (im wahrsten Sinn des Wortes) sind.
<P ALIGN=justify>
Es wird zwar wieder einige geben, die rummaulen, weil es gr&ouml;&szlig;tenteils
"nur" Polygone hat und nicht alles mit Texturen belegt ist, aber es sieht
trotzdem sehr gut aus. Die Grafik ist sehr fl&uuml;ssig; ich konnte da
jedenfalls kein Ruckeln entdecken. Die Geschwindigkeit mit der sich der
Roboter bewegt ist sehr realistisch.
<P ALIGN=justify>
Die Objekte, die mit Texturen belegt sind, z.B. die Panzer, Helikopter,
Flugzeuge etc. sehen fantastisch aus. Was mich aber am meisten begeistert
hat, ist das fantastische Fahr- und Flugverhalten der Angreifer (Panzer
und Hubschrauber). Sieht absolut realistisch aus, wenn z.B. die
Hubschrauber nachdem sie zwei Raketen abgeschossen haben wieder abdrehen,
um dann f&uuml;r die n&auml;chste Salve neu anzufliegen. echt fantastisch.
<P ALIGN=justify>
Auch wenn z.B. ein Panzer zerfliegt, erkennt man, wenn man nah genug dran
ist, die Liebe zum Detail; der zerspringt n&auml;mlich nicht einfach in
einfache Bl”cke, wie die H&auml;user, sondern man kann Kolben, Zahnr&auml;der und
Turbinenteile erkennen. Absolut geil.
<P ALIGN=justify>
Die Steuerung ist sehr gut gelungen. Nach einer winzigen Gew&ouml;hnungsphase
beherscht man sie problemlos.
<P ALIGN=justify>
Die Soundeffekte und die Ingame-Music sind IMO auch sehr gut gelungen.
<BR>
Cool klingt es, wenn der Roboter geht, ist ein richtig gutes Stampfen.<BR>
Hier liegt aber auch ein kleiner Kritikpunkt. Warum h&ouml;rt man, wenn man
geht und gleichzeitig schie&szlig;t, nur das Schie&szlig;en und nicht auch das Gehen?
Das Gehen h&ouml;rt man erst wieder, wenn man mit dem Schie&szlig;en aufgeh&ouml;rt hat.
<P ALIGN=justify>
Iron Soldier ist wieder ein Spiel, da&szlig; in NTSC-Overscan programmiert ist,
d.h., auch auf einer PAL-Konsole hat man keine schwarzen Balken,
allerdings l&auml;uft es mit 50Hz etwas langsamer, aber immernoch sehr fl&uuml;ssig.
<P ALIGN=justify>
Alles in Allem, und trotz des kleinen Kritikpunktes beim Sound, ein sehr
gutes Spiel, das in keiner Sammlung bei Jaguar Besitzern fehlen sollte.
IMO w&uuml;rde es eine Wertung um die 90 - 95% ohne Weiteres verdienen.
Man mu&szlig; Marc Rosocha und sein Team wirklich loben; weiter so.
<P>

<B>Wertung:</B>
<P>
<TABLE ALIGN=center BORDER width=50>
<TR>
<TH>Grafik<TD ALIGN=center>90 %
<TR>
<TH>Sound<TD ALIGN=center>85 %
<TR>
<TH>Spielspa&szlig;<TD ALIGN=center>85 %
</TABLE>

<HR>
</BODY>

</HTML>
