<HTML>

<HEAD>
<!-- erstellt: 07.05.1996 12:13:43 -->
<TITLE>Kasumi Ninja</TITLE>
</HEAD>

<BODY>
<H1>Kasumi Ninja</H1>
<HR>
<H3>Kasumi Ninja - The Final Fight for Mortal Kombat?<BR>
(oder: Atari pr&auml;sentiert zum Fest der Liebe eine reine Blutorgie)</H3>

<P ALIGN=justify>Nach etlichen Verz&ouml;gerungen kommen wir nun im Genu&szlig; des erstes speziell fÅr
den Jaguar entwickelten Pr&uuml;gelspiels, nachdem "Dragon - The Bruce Lee Story"
nur eine aufgepeppte Konvertierung von den 16-Bit Konsolen war.</P>

<P ALIGN=center>Handmade Software aus England zeigt kein Skrupel und machte das Spiel zu
einem Blut-Gemetzel wo dagegen selbst Mortal Kombat 2 harmlos aussieht.
Jeder Schlag und das Blut fliest literweise &uuml;ber den Screen, nat&uuml;rlich
absolut unrealitisch, aber es sieht witzig aus.<BR>
Ach ja, neben den Blut wurden insgesamt 8 K&auml;mpfer eingebaut, davon
6 m&auml;nnliche und 2 weibliche (lechz ;-)).<BR>
Da w&auml;ren die Zwillings-Ninjas Habaki und Senzo, Chagi der Kickboxer (der
schon in wie der Lambadanator mitgespielt hat, sowie Kickboxing Kidd I bis
XII ;-)), Alaric der K&ouml;nig der Goten, Thundra die K&ouml;nigin der Amazonen
(geil... sabbel ;-)), Pakawa der H&auml;uptling der Comanchen, Danja die W&auml;chterin
der Stadt ;-) (w&uuml;rg!) und Angus MacGreggor, der schottische Unruhestifter ;-)</P>

<P ALIGN=center>Jeder dieser Charakeren hat ein gewisse Auswahl von Grundschl&auml;gen und
personenspezifische Specail-Moves (Beam mich weg Scotty ;-), Feuerball,
Wirf mich weg ;-) usw. ...), sowie wirklich fantasievoll geschmacklose
Endmoves (Einer spaltet den Gegner in 2 Teile, der Andere steckt dem
Verlierer eine Dynamitstange in den Mund und bumm ;-) usw. ...).</P>

<P>Spielerisch sind die Gegner im EASY-Modus kinderleicht (warum, ab 17? ;-))
und auch im NORMAL-Modus spielt man es ohne gr&ouml;&szlig;ere Probleme durch.
Wenn man erstmal seinen Gegner in die Ecke hat, dann gibt es Dresche und der
Kampf ist so gut wie entschieden.<BR>
Die einzige Herausforderung ist der HARD und der NINJA GOD-Modus, in den
letzten Modus hat man KEINE Credits, d.h. es kann nur Einen geben.
Insgesamt gesehen ist Kasumi Ninja in grafischer Hinsicht besser als
Mortal Kombat 2, die aus mehrenen Ebenen bestehenden Hintergr&uuml;nde sehen
hervorragend aus, aber leider sind die Animation der Figuren nicht so
fl&uuml;ssig (ist halt nur ein 4 MB-Modul ;-)). Die Musik ist anfangs noch
recht nett, aber geht w&auml;hrend des Spiels auf den Geist wie auf die
glasklare Sprachausgabe von einem d&auml;mmliche lispelnden Japsen.</P>

<TABLE><TH valign=top>Fazit:</TH>
<TD>F&uuml;r Jaguar-Pr&uuml;gelfreaks mit Blutrausch absolut zu empfehlen,
       seichtere Naturen sollten "Probe spielen"...
       Es werden Wetten angenommen, wie schnell das Game auf den Index ist ;-)</TD></TABLE>
<P>
<B>Wertung:</B>
<P>
<TABLE ALIGN=center BORDER width=50>
<TR>
<TH>Grafik<TD ALIGN=center>90 %
<TR>
<TH>Sound<TD ALIGN=center>60 %
<TR>
<TH>Spielspa&szlig;<TD ALIGN=center>75 %
</TABLE>


<HR>
</BODY>

</HTML>
