<HTML>

<HEAD>
<!-- erstellt: 07.05.1996 13:06:33 -->
<TITLE>Wolfenstein 3D</TITLE>
</HEAD>

<BODY>
<H1>Wolfenstein 3D</H1>
<HR>
<H3>ROTK&Auml;PPCHEN UND DER WOLF IN DER DRITTEN DIMENSION</H3>

<P ALIGN=justify>Als m&auml;rchenhaft kann man Id's Erstling f&uuml;r den Jaguar ja nicht gerade
bezeichnen, hier geht's n&auml;mlich zur Sache. Zur Sache ist diesbez&uuml;glich
auch die BPS gegangen, wodurch das Spiel zu einer gewissen Ber&uuml;hmtheit
gelangt ist, in den Staaten wird sogar mit dem Slogan "in Deutschland
indiziert" geworben.</P>

<P ALIGN=justify>Ich setze also an dieser Stelle voraus, da&szlig; durch obige Einleitung klar
geworden ist, um welches Spiel es hier geht. Vorliegende Version stellt
eine pixelgenaue Umsetzung der PC-Variante dar, wobei aber nicht auf
Verbesserungen im Detail verzichtet wurde. So f&auml;llt sofort beim ersten
Spieleinstieg die h&ouml;here Grafikaufl&ouml;sung positiv auf, Pixelz&auml;hlerei ade.
Weiterhin gesellen sich zum bisherigen Waffenarsenal, welches aus Pistole, MG etc. besteht, ein sehr effektiver Flammenwerfer sowie ein fast
ebenso guter Granatenwerfer hinzu. F&uuml;r diese beiden "Spielzeuge" mu&szlig;
allerdings gesondert Munition gesammelt werden, w&auml;re ja auch "m&auml;rchenhaft", einen Flammenwerfer mit Projektilen zu laden. Aber wie oben schon
erw&auml;hnt, ist der "3D-Knaller" (der schon einen auch allseits bekannten
Nachfolger hat) eben nicht dieses; arg blutig und bleihaltig sieht das
Bild aus, was sich dem Spieler bietet, sobald er sich daran macht, die
fl&uuml;ssig scrollenden, dreidimensionalen Gem&auml;uer zu betreten. Ein mit unverkennbar amerikanischem Akzent (die Programmierer lassen gr&uuml;&szlig;en) gerufenes "Achtung !" l&auml;&szlig;t mich erschrecken, und kurz darauf &ouml;ffnet sich
auch schon die vor mir liegende T&uuml;r. Ein wei&szlig;gekleideter Soldat richtet
seinen Revolver auf mich, doch (Pech f&uuml;r ihn) ich bin schneller: Blutend
bricht er zusammen. In dieser Weise k&auml;mpft man sich immer weiter vor,
nur um auf immer st&auml;rkere Gegner (die sich jeweils durch einen anderen
Ausruf ank&uuml;ndigen) und Endgegner (waffenstarrende Einzelk&auml;mpfer, verr&uuml;ckte, wild mit Bomben um sich schmei&szlig;ende Wissenschaftler u.v.a.) zu treffen. Sogar &uuml;berraschend angreifende Zombies und Sch&auml;ferhunde z&auml;hlen zum
Repertoire. Um sich dieser zu erwehren, reicht nat&uuml;rlich das anfangs bereitgestellte Equipment nicht aus, Erg&auml;nzungen siehe oben. Auch die Gesundheit unseres Helden, dessen Gesicht im Kleinformat links unten zu
sehen ist und immer situationsgerechte Grimassen schneidet, mu&szlig; ab und
an wieder auf Vordermann gebracht werden, was durch aufzusammelnde Speisen und Medi-Kits geschieht. Zudem sind Bonusgegenst&auml;nde in Form von
Schmuck und Pokalen zu ergattern. Wer sich genauer umsieht, wird
hinter Gem&auml;lden und Emblemen f&uuml;ndig: Die Wand schiebt sich zur&uuml;ck und
enth&uuml;llt kleine, teilweise bewachte Schatzkammern. Dies alles geht durch
die frei w&auml;hlbare Tastenbelegung des Joypads einfach von der Hand, sicher
bewegt man sich durch die schnell vorbeiziehenden Passagen. Ein teils
unauff&auml;lliger, teils spannungserzeugender Soundtrack tr&auml;gt zum positiven
Gesamteindruck bei. Leider wurde aber die Grafik (abgesehen von der h&ouml;heren Aufl&ouml;sung und der schnelleren Ausgabe) nicht verbessert, auch in
der Jaguarversion laufen wir durch G&auml;nge, die mit unausgef&uuml;llten Decken
und B&ouml;den auskommen m&uuml;ssen. Insgesamt gesehen wird das Game den Jaguarf&auml;higkeiten, wie schon so oft gesagt, nicht gerecht (wo bleibt Alien vs.
Predator ?!). Sofern einem das Spielprinzip gef&auml;llt, lohnt eine Anschaffung nat&uuml;rlich dennoch (hohe Zahlungsbereitschaft vorausgesetzt).</P>
<P ALIGN=justify>Ein anderes Thema ist die Verf&uuml;gbarkeit des Spiels in Deutschland. Durch
die hierzulande erfolgte Indizierung ist auch eine Ver&ouml;ffentlichung des
Games unter anderem Namen sehr unwahrscheinlich, was ebenso f&uuml;r eine
eventuell entsch&auml;rfte Version (wie auf dem SNES) gilt.</P>
<P>
<B>Bewertung:</B>
</P>
<TABLE ALIGN=center BORDER width=50>
<TR>
<TH>Grafik<TD ALIGN=center>70 %
<TR>
<TH>Sound<TD ALIGN=center>70 %
<TR>
<TH>Spielspa&szlig;<TD ALIGN=center>75 %
</TABLE>



<HR>
</BODY>

</HTML>
