<HTML>

<HEAD>
<!-- erstellt: 08.05.1996 07:11:07 -->
<TITLE>Hover Strike</TITLE>
</HEAD>

<BODY>
<H1>Hover Strike</H1>
<HR>
<H3>Cybermorph mit Texture-Mapping?</H3>

<P ALIGN=justify>Dies denkt man sich als erstes, wenn man das Spiel sieht.
Die Spielidee ist fast mit Cybermorph identisch also kann als gut
bezeichnet werden. In Sachen Geschwindigkeit ist Hover Strike nicht
so schnell wie Cybermorph, aber man folgendes bedenken:</P>

<P><I>[Andreas Hippauf on]</I></P>

<P ALIGN=justify>Das Spiel ist komplett texturemapped und im Gegensatz zu den Doom
Texturen kann man sich hier nach oben/ unten drehen (wenn das Hover
einen Berg rauf oder runter f&auml;hrt) oder man kann seitlich schaukeln.
Der Schaukeleffekt ist die H&ouml;lle! Optisch toll mu&szlig; man all sein
K&ouml;nnen als Steuermann aufbieten um auf hoher See oder in einem
engen Wassergraben noch gegen einige Gegner angehen zu k&ouml;nnen.
Toll gemacht.</P>

<P ALIGN=justify>Es gibt eine Au&szlig;enkamera, die man aber tunlichst vermeiden sollte,
da trifft man nur noch per Zufall.
Die Waffensysteme sind nicht sehr zahlreich, aber man kann sie
gut f&uuml;r die unterschiedlichen Ziele (Boden/Luft) aufteilen und einige
Strategien damit ausarbeiten. Beispiel?
Vor mir ein Berg, auf dem Radar erkenne ich bereits einen Punkt (Gegner!)
der sich hinter dem Berg befindet. Ich schalte auf "Guided Missiles",
w&auml;hle auf dem Radar den Punkt an - "Locked!". Wenn ich jetzt feuere
landet die Missile trotzdem meistens im Berg, so schlau ist sie auch
wieder nicht. Also das Hover parallel zum Berg gebracht, so das das
Ziel jetzt zu meiner Rechten ist. Beschleunigen, dann das Hover
drehen - es gleitet weiter in die erste Richtung und ich beharke
den Gegner mit der Boardkanone. Als er mich erkennt und das Feuer
er&ouml;ffnen will lasse ich die Rakete los - der Berg ist jetzt kein
Hindernis mehr - und das war's.
Nat&uuml;rlich geht es recht selten soooo ruhig zu!</P>

<P><I>[Andreas Hippauf off]</I></P>

<P ALIGN=justify>Die Steuerung ist ein Mischung aus Iron Soldier und Cybermorph, somit
ist die Steuerung f&uuml;r meinen Geschmack zu kompliziert, nach meiner
Meinung sollte sich nicht der Spieler an die Steuerung gew&ouml;hnen m&uuml;ssen.
Es ist also schon etwas &Uuml;bung von N&ouml;ten um nicht wild durch die Gegend
zu treiben und die Gegner gezielt zu treffen...</P>

<P ALIGN=justify>Der Sound und die Soundeffekte sind ok, nur wurden die Stereo-Effekte
vertauscht, was schon wirklich peinlich ist...</P>

<P ALIGN=justify>Das Gameplay ist gut, da das Spiel mehr Missionen als Iron Soldier
bietet und es kann jederzeit abgespeichert werden, welches schw&auml;chere
Spieler freuen wird. Leider unterscheiden die einzelnen Missionen sich
nicht besonders es geht meisten darum irgendwelche Objekte zu zerst&ouml;ren,
welches auf Dauer ein wenig eint&ouml;nig werden kann.
</P>
<TABLE>
<TH VALIGN=top>Fazit:</TH>
<TD>H&auml;tte das Spiel die gerade aufgez&auml;hlten M&auml;ngel nicht, w&auml;re es
       das beste Jaguar-Spiel was es derzeit gibt, aber so reicht es
       leider nur f&uuml;r die Bewertung "gut".</TD></TABLE>


<TABLE ALIGN=center BORDER width=50>
<TR>
<TH>Grafik<TD ALIGN=center>85 %
<TR>
<TH>Sound<TD ALIGN=center>65 %
<TR>
<TH>Gesamt<TD ALIGN=center>80 %</TABLE>


<HR>
</BODY>

</HTML>
