<HTML>

<HEAD>
<TITLE>Joystick f&uuml;r den Jaguar selbstgemacht!</TITLE>
</HEAD>

<BODY>
<H6>Jaguar-Magazin 2</H6>
<P>
<H1>Joystick f&uuml;r den Jaguar selbstgemacht!</H1>



<HR>

<P ALIGN=justify>Das Joypad des Jaguars z&auml;hlt trotz seiner Gr&ouml;&szlig;e nicht zu den schlechtesten,
nur f&uuml;r einige Spiele wie z.B. Kasumi Ninja oder Ballerspiele w&uuml;rde man sich
einen Joystick w&uuml;nschen. Leider gibt es bisher von Atari keinen Joystick zu
kaufen, darum mu&szlig; man sich selbst was ausdenken. Es sind hier mehrere
M&ouml;glichkeiten beschrieben (wie man will: je nach Arbeitsaufwand, Kosten,
K&ouml;nnen, Lust (nicht was ihr wieder denkt), etc...). Bei exotischen Bauteilen
wird hier immer die Bestellnummer der recht bekannten Firma Conrad angegeben,
das soll keine Werbung sein, es soll nur f&uuml;r jeden einfach m&ouml;glich sein, die
ben&ouml;tigten Bauteile zu bekommen.</P>


<H3>Ein mi&szlig;lungener Versuch:</H3>


<P ALIGN=justify>Ich habe mich mal daran gemacht das Jaguar-Joypad so umzubauen, da&szlig; man ohne
weiteres Joystick des SEGA-Megadrives anzust&ouml;pseln kann. Nach einigen
Versuchen mu&szlig;te die Idee meinerseits begraben werden, nur die Richtungen
funktionierten, denn es gab bei den Feuerkn&ouml;pfen Probleme...
Falls jemand es geschaft hat seine Schaltung so aufzubauen um einen SEGA-
Joystick so anzuschliessen ohne diesen umbauen zu m&uuml;ssen, soll er sich bei
mir melden. <A HREF="#adresse">Adresse</A> siehe am Schlu&szlig;...</P>


<P>Jetzt zu den anderen Varianten die geklappt haben:</P>


<P>An Arbeitsger&auml;t brauchen wir folgendes:</P>

<P ALIGN=justify>Einen L&ouml;tkolben, L&ouml;tzinn, Feile, Rundfeile (falls vorhanden), ein scharfes
Messer (Teppichmesser), Schere, Schlitz- und Kreuzschraubenzieher, eine
Zange. Schleifpaper w&auml;re auch nicht schlecht. Andere Hilfsmittel wie
Steinschleifer, Me&szlig;ger&auml;t w&auml;ren hilfreich, sind aber nicht unbedingt n&ouml;tig.
Bei manchen Vorschl&auml;gen w&auml;re auch ein Bohrer nicht schlecht.</P>


<P>Es geht los!</P>



<H2>1. Anschlu&szlig; f&uuml;r den Joystick am Joypad</H2>


<P ALIGN=justify>Wir &ouml;ffnen das Joypad. Die Schrauben befinden sich unter den Gummipl&auml;tchen
auf der Unterseite, die man vorsichtig mit einem Schlitzschraubenzieher
raushebt. Dann die Schraueben rausdrehen. Dann l&ouml;st man noch die beiden
inneren Schrauben und man hat die beiden durch ein Flachbandkabel verbundenen
Platinen in der Hand, die man vorerst beiseite legt.</P>


<P><U>Der saubere und sch&ouml;ne Weg!</U></P>


<P ALIGN=justify>Im Unterteil des Joypads sieht man zwei klein "Trennw&auml;nde" zwischen diesen
werden wir den Anschlu&szlig; f&uuml;r den Joystick einbauen. Dazu schleift man die
Unter- und Oberkante des m&auml;nnlichen HighDensitysteckers ab:</P>

<P>Von vorne sieht der Orginalstecker etwa so aus:</P>
<PRE>
    -----------------------------
    |                           |
    |   #####################   |
    |    #                 #    |
    | O   #               #   O |
    |      #             #      |
    |       #############       |
    |                           |
    -----------------------------
</PRE>
<P>Nach der Schleifaktion sieht es dann von Vorne so aus:</P>

<PRE>
    ----#####################----
    |    #                 #    |
    | O   #               #   O |
    |      #             #      |
    --------#############--------
</PRE>

<P>Dann schleift man nochmal etwas weg damit es so aussieht:</P>

<PRE>
        #####################
    ----|#                 #|----
    | O   #               #   O |
    |      #             #      |
    --------#############--------
</PRE>

<P ALIGN=justify>So nun wirds schon etwas schwieriger. Wir werden nun an der Stelle
zwischen den beiden "Trennw&auml;nden" ein Loch hineinfeilen das die gleiche Form
hat wie der m&auml;nnliche SUB-D Stecker.</P>
<PRE>
        #####################
         #                 #
          #               #
           #             #
            #############
</PRE>

<P ALIGN=justify>Diese Form also. Damit es sauber aussieht mu&szlig; man vorsichtig arbeiten, um
sich die Form am Kunsstoff anzuzeichen kann man folgenden Trick anwenden:</P>

<P ALIGN=justify>Man erhitzt vorne an der &Ouml;ffnung des Steckers das Metall (mit Feuerzeug,
Kerzenflamme ist schlecht da sie Ru&szlig; bildet!) und dr&uuml;ckt es (hei&szlig;!, mit einer
Zange!) von der Innenseite gegen den Kunstoff, die untere Kante des Steckers
sollte am Boden des Geh&auml;uses aufliegen. Man bekommt nun einen Abdruck nach
dem man feilen mu&szlig;. Eine Rundfeile und/oder ein scharfes Messer ist hier
recht hilfreich. Der Stecker MUSS relativ genau passen, damit rechts und
links noch genug Plastik f&uuml;r die Befestigungsschraueben sind!</P>

<P ALIGN=justify>Man setzt den zugeschliefenen Stecker nun von Innen ein. Man mu&szlig; jetzt zwei
L&ouml;cher f&uuml;r die Schrauben bohren. Damit das gut klappt hab ich auch wieder mit
hei&szlig;em Metall gearbeitet. Man nimmt einen stabilen Draht oder eine Nadel (mit
der Zange). Die macht man wieder hei&szlig; und dr&uuml;ckt diese bei eingesetztem
Stecker durch die Bohrung im Stecker und durch den Kunststoff.
Mit einem Bohrer erweitern wir das Loch so da&szlig; die beiden Schrauben passen.
Ist das geschaft, m&uuml;ssen wir aus dem Oberteil des Joypadgeh&auml;uses so hinten
ausfeilen damit der Deckel pa&szlig;t.</P>

<P ALIGN=justify>Der Stecker wird jetzt noch nicht festgeschraubt, man nimmt jetz etwa 15 cm
von dem Flachbandkabel. Jetzt brauchen wir wieder die beiden Platinen:
auf der kleineren an der siche die Feuerbuttons und Steuerkreuz befinden,
sieht man die L&ouml;tpunkte des Flachbandkabels das zur Tastaturplatine f&uuml;hrt.
Man legt die Platine nun so vor sich hin:</P>

<PRE>
      (---------------------------------------)
     (      0        1           13      0     )
    (                *************              )
   (     0     0                       0         )
    (                 ==   ==                   )
     (      0                        0         )
      (---------------------------------------)
</PRE>

<P ALIGN=justify>Man verbindet jetzt L&ouml;tpin 1 an Pin 1 die Buchse, L&ouml;tpin 2 an Pin 2, etc. so
an, da&szlig; man das Flachbandkabel das man nun anl&ouml;tet &uuml;ber die obere Kante der
Platine f&uuml;hrt und unter beiden Platinen des Joypads zur Aussparung f&uuml;hrt die
wir vorher hineingearbeitet haben. Neben den 13 L&ouml;tpunten legen wir uns noch
Masse und +5V an die Buchse. Dazu sehen wir ganz links aussen auf der 10er-
Blockplatine 14 L&ouml;tpunkte an denen durch eine Steckleiste das Kabel des
Joypads h&auml;ngt. Von unten aus gez&auml;hlt liegt an Pin 6 Masse und an Pin 8 +5V.
Wir verbinden nun diesen 8. L&ouml;tpunkt mit Pin 14 der Buchse und L&ouml;tpunkt 6
mit Pin 15. Ist auch dies geschaft k&ouml;nnen wir alles nun zusammensetzen.
Vorher w&auml;re es von Vorteil wenn man nochmal &uuml;berpr&uuml;ft ob man nicht
gegebenenfalls einen Kurzschlu&szlig; fabriziert hat. Wenn man sauber arbeitet kann
man das mit dem Auge entscheiden, ein Me&szlig;ger&auml;t gibt jedoch absolute
Sicherheit. Die Buchse wird hinten festgeschraubt, (Flachbandkabel unter den
beiden Platinen herumf&uuml;hren!) die Platine der 10er Tastatur wieder
festgeschraubt. Die Tasten wieder einsetzen, Deckel drauf und zuschrauben.
Pl&auml;tchen wieder drauf. Das Joypad sollte, wenn man nichts falsch gemacht hat,
genauso funktionieren wie vorher, nur das wir jetzt an der R&uuml;ckseite eine
Buchse haben.</P>


<P><U>Der etwas unsch&ouml;nere aber einfachere Weg</U></P>


<P ALIGN=justify>Bei der obigen Methode ist das Ausfeilen des Lochs f&uuml;r die Buchse etwas
schwierig. Deshalb kann man es auch so machen das man ein etwas l&auml;ngeres
St&uuml;ck Flachbandkabel nimmt dieses genauso anl&ouml;tet wie oben beschrieben, nur
das man hinten einfach ein Loch bohrt oder einen Schlitz hineinfeilt um das
Flachbandkabel herauszuf&uuml;hren. Die Buchse braucht nat&uuml;rlich auch nicht
zugeschliffen werden. Wir stecken die Buchse ganz einfach in ein Geh&auml;use f&uuml;r
15polige SUB-D-Verbinder. Dieser sollte aber nicht zu weit heraush&auml;ngen um zu
verhindern, da&szlig; er beim Spielen mit dem Pad st&ouml;rt.</P>


<P>Die Buchse an unserem Extended Joypad hat nun folgende Belegung:</P>
<PRE>
1  - Richtung: Runter
2  - Richtung: Links
3  - Richtung: Hoch
4  - Pause
5  - Button C
6  - Button C Masse
7  - Button B
8  - Button B Masse
12 - Button A
10 - Option
11 - Option Masse
12 - Richtung: Rechts
13 - Masse (alle Richtungen, Button A, Pause)
14 - +5V
15 - Masse
</PRE>

<P ALIGN=justify>So Sachen wie Button C auf Button C Masse unbedingt einhalten sonst
funktionierts nicht! Das sind zwar keine "echten" Massen aber ich hab sie
einfach mal so genannt.</P>




<H3>Was schliessen wir nun daran an?</H3>


<P ALIGN=justify>Leider passen keine Standardjoysticks an unser neues "Extended-Jagpad".
Darum mu&szlig; man sicher wieder selbst was einfallen lassen. Ich hab hier wieder
verschiedene Vorschl&auml;ge:</P>


<H4>1. Wir machen uns einen eigenen "Spielhallenjoystick"!:</H4>


<P ALIGN=justify>Was mir an vielen Joysticks die man im Handel kaufen kann mi&szlig;f&auml;llt,
sind all diese teilweise sinnlosen Sonderfunktionen (einstellbares
Dauerfeuer, Verlangsamung, etc.) und die im Gegensatz zu Spielhallenkn&uuml;pel
schlechten Steuerhebel (es kommt einfach kein Spielehallenfeeling auf).
Dabei kosten die Dinger sehr viel und sind oft f&uuml;r Linksh&auml;nder kaum oder
schlecht geeignet, was man auch in der Spielhalle vermi&szlig;t. Ich bin zwar kein
Linksh&auml;nder habe aber ein paar Freunde mit denen ich mitf&uuml;hlen kann...</P>

<P ALIGN=justify>Nungut, was hat das alles mit einem Joystick f&uuml;rs Jaguar zu tun? Wenn der
Berg nicht zum Propheten kommt, kommt halt der Prophet zum Berg... Wir bauen
unseren Joystick selbst!</P>

<P ALIGN=justify>Die folgende Bauanleitung soll nicht als exakte Beschreibung sondern eher als
Anregung verstanden werden, man kann sicher vieles(?!) besser machen.
Au&szlig;erdem gebe ich an manchen Punkten verschiedene M&ouml;glichkeiten, bzw. Tips
und Anregungen f&uuml;r Erweiterungen. Ich w&uuml;rde mich freuen wenn man mir Ideen
und Verbesserungsvorschl&auml;ge zusendet.
</P>

<P>Wir brauchen:</P>
<UL>
<LI>1 Spielhallenkn&uuml;ppel (gleich mit Mikroschalter)
  z.B. Conrad Elektronic, Bestellnummer: 980374-33

<LI>4 Steck-/Feingewindeschrauben mit passenden Muttern f&uuml;r die
  Befestigung der Kn&uuml;ppeleinheit. F&uuml;r obige Kn&uuml;ppeleinheit: 3mm
  Durchmesser und 2 cm lang

<LI>1 15 Pin High Density SUB-D weiblich Stecker

<LI>2 kleine Schrauben (1,5 mm) die durch die L&ouml;cher des SUB-D passen
  mit zwei passenden Muttern

<LI>0,5 m Flachbandkabel 15 polig

<LI>1 Geh&auml;use mit Platz f&uuml;r Feuerkn&ouml;pfe und Kn&uuml;ppel
  z.B. Eurobox von Conrad Elektronic (523380-33)
  (leider etwas hoch aber vielleicht f&auml;llt jemandem was anderes ein! Oder
  man baut sich aus Holz selbst etwas, oder man baut gleich das ganze Jaguar
  in ein Spielhallenkasten ein ;-) )

<LI>3 Feuerkn&ouml;pfe mit Schalter (am besten Mikroschalter)

<LI>8 bzw. 14 Flachsteckh&uuml;lsen unisoliert (4,8mm) (Conrad 732796-33)

<LI>ca. 1-2 m Schaltlitze
(kann man auch z.B. aus einem alten Joystickkabel rausziehen)

<LI>gegenbenenfalls ein kleines St&uuml;ck Lochrasterplatine (ca. 15*8 L&ouml;cher)

<LI>gegebenfalls 2 Einbautaster (Kontakt falls gedr&uuml;ckt)

</UL>

<P ALIGN=justify>Mal etwas zur St&uuml;ckliste: Man mu&szlig; sich nicht daran halten vielleicht findet
man ja eine bessere L&ouml;sung. Probleme gibts bei Feuerkn&ouml;pfen, ich hab noch
nichts ad&auml;quates zu den Competition Pro- oder Spielhallenkn&ouml;pfen gefunden.
Wenn jemand wei&szlig; wo man Feurkn&ouml;pfe bestellen kann -> Nachricht an mich!
Ich hab die drei ben&ouml;tigten Kn&ouml;pfe aus zwei alten Competion Pro's ausgebaut:
Hier gibt es jedoch zwei verschiedene: Feuerkn&ouml;pfe mit Mikroschalter und
welche mit einfachen Kontaktpl&auml;ttchen. Ich finde ersteres wesentlich besser...
hat man auch Mikroschalter bei den Feuerkn&ouml;pfen, braucht man 14
Flachsteckh&uuml;lsen, ansonsten 8 f&uuml;r den Steuerkn&uuml;ppel.</P>

<P>Nun gehts los:</P>

<P ALIGN=justify>Je nach verwendeten Geh&auml;use mu&szlig; man sich jetzt entscheiden wie man Joystick
und Kn&ouml;pfe anbringt. Linksh&auml;nder werden die Buttons anders anbringen als
Rechtsh&auml;nder. Ich hab die Kn&ouml;pfe genauso angeordnet wie am Pad. Hat man nun
die optimale Postion gefunden bohrt man nun L&ouml;cher f&uuml;r die Buttons und den
Stick. Da man selten so gro&szlig;e Bohrer hat, mu&szlig; man so gro&szlig;e L&ouml;cher wie m&ouml;glich
Bohren und diese dann ausfeilen und dadurch vergr&ouml;&szlig;ern. Die L&ouml;cher f&uuml;r die
Buttons sollten nat&uuml;rlich so sein, da&szlig; sie nicht durchfallen ;-) Die Kn&ouml;pfe
kann man dann mit etwas Klebstoff festkleben (falls man diese Competition
Buttons verwendet.)</P>
<P ALIGN=justify>Bei der Eurobox mu&szlig; man noch die Zapfen und die Gu&szlig;stelle wegschleifen, sonst
pa&szlig;t nichts hinein.</P>
<P ALIGN=justify>Das Loch des Steuerkn&uuml;ppels mu&szlig; nat&uuml;rlich etwas gr&ouml;&szlig;er sein als der
Durchmesser des Hebels. Wenn das Loch etwas unsch&ouml;n aussieht, macht nichts,
da kommt die schwarze Scheibe dr&uuml;ber die dem Conrad-Kn&uuml;ppel beiliegt. Jetzt
m&uuml;ssen noch die 4 L&ouml;cher f&uuml;r die Kn&uuml;ppelbefestigung durch das Geh&auml;use gebohrt
werden. Danach Schrauben rein, Muttern drauf und festziehen.</P>
<P>Falls man auch den Pausen und Optionknopf haben m&ouml;chte mu&szlig; man f&uuml;r diese
nat&uuml;rlich auch noch L&ouml;cher bohren und die Taster einsetzen!</P>

<P ALIGN=justify>Nun zur Verkabelung, die ja aus der Belegung des Ports am Joypad schon
ersichtlich sein sollte...</P>

<P ALIGN=justify>Wir brauchen nun ein St&uuml;ck (30 - 40 cm sollten f&uuml;r die Verbindung
Joystick-Joypad vollkommen ausreihen) Kabel (Flachband oder Normales), an
das wir den weiblichen 15-poligen SUB-D l&ouml;ten. An die andere Seite l&ouml;tet man
dann die kleine Lochrasterplatine oder man verbindet die einzelenen Adern
gleich mit den Schaltern. Man sollte jedoch die Kabel nicht auf die
Mikroschalter l&ouml;ten sondern die Flachsteckverbinder verwenden, damit man
sp&auml;ter defekte Schalter schnell austauschen kann. Wenn man das ganze sch&ouml;n
sauber &uuml;ber die Lochrasterplatine macht mu&szlig; man die Schalter mit der
Schaltlitze verbinden.</P>

<P ALIGN=justify>Zu den Mikroschaltern: Es gibt Mikroschalter mit 2 oder 3 Kontakten. die mit
2 Kontakte sollten nat&uuml;rlich Schalter sein, die schliessen. Hier gibt es
keine Probleme. Eingang an den einen Kontakt, Ausgang an den anderen.
Die mit 3 Kontakten k&ouml;nnen bei einem Druck auf den Schalter den Stromkreis
&ouml;ffnen oder schliessen.</P>

<PRE>
 -""----------
 |            |--- 2
 |            |--- 3
 -------------
          |
          --- 1
</PRE>
<P>Wir brauchen Kontakt 1 und 3.</P>


<P>Also nun wir verbinden &uuml;ber die entsprechenden Mikroschalter (beim
Steuerkn&uuml;ppel aufpassen!) bzw. Taster:</P>

<PRE>
1 - 13       (Runter)
2 - 13       (Links)
3 - 13       (Hoch)
4 - 13       (Pause)
5 - 6        (Button C)
7 - 8        (Button B)
9 - 13       (Button A)
10 - 11      (Option)
12 - 13      (Rechts)
</PRE>
<P ALIGN=justify>14 und 15 kann man verwenden wenn man noch eigene Zusatzschaltungen wie
Dauerfeuer oder ein paar nette LEDs, u.a. einbauen will. 14 (+5V) und 15
(Masse).</P>

<P ALIGN=justify>Das Anschlu&szlig;kabel sollte man auf der R&uuml;ckseite herausf&uuml;hren, damit man das
Joypad gut neben den Joystick legen kann!</P>

<P ALIGN=justify>Damit ein Geh&auml;use rutschfest steht, sollte man noch  rutschfeste Ger&auml;tef&uuml;&szlig;e
anbringen. (Conrad: 525804-33) Vier sollten reichen.</P>

<P ALIGN=justify>Wenn man alles nochmal &uuml;berpr&uuml;ft hat, kann man das Geh&auml;use zusammensetzen und
mit dem neuen Joystick loslegen! Viel Spa&szlig;- Sucht euch gleich jemanden den
ihr bei KN verpr&uuml;geln k&ouml;nnt...</P>


<P><U>Umbau/Erweiterung eines Vorhandenen Joysticks mit mindestens 3 Buttons</U></P>


<P ALIGN=justify>Will man sich die ganze Bohrerei und Feilerei eines
Joystickselbstbaus ersparen, kann man auch einen handels&uuml;blichen digitalen
Joystick mit mindestens drei Buttons umbauen. Gibt es f&uuml;r Amiga, Sega,
Nintendo in den verschiedensten Ausf&uuml;hrungen zu unterschiedlichsten Preisen...</P>

<P ALIGN=justify>Gut da jeder Joystick anders ist kann ich keine detailierte Beschreibung
geben, besonders dann nicht wenn man vorhandene Sonderfunktionen (Dauerfeuer
und &auml;hnliches) nutzen will.</P>


<P>Hier ben&ouml;tigt man:</P>
<UL>
<LI>15 poligen High Density SUB-D weiblich mit Geh&auml;use

<LI>15 Poliges Kabel ca. 30-40 cm.

<LI>gegenbenenfalls Schaltlitze (1m)
</UL>
<P ALIGN=justify>Man l&ouml;tet an das eine Ende den poligen weiblichen SUB-D Stecker. Nun mu&szlig; man
&uuml;ber die im Joystick vorhandenen Schalter folgenden Verbindungen herstellen:<BR></P>

<PRE>
1 - 13       (Runter)
2 - 13       (Links)
3 - 13       (Hoch)
4 - 13       (Pause)
5 - 6        (Button C)
7 - 8        (Button B)
9 - 13       (Button A)
10 - 11      (Option)
12 - 13      (Rechts)
</PRE>

<P ALIGN=justify>Dazu braucht man jedoch das vorhandene Kabel und die interne Verkabelung
nicht unbedingt entfernen, man l&ouml;tet die Verbindungen f&uuml;rs Jaguarjopad
zus&auml;tzlich an und bohrt gegebenenfalls noch ein Loch um das Kabel f&uuml;r die
Verbindung mit dem Joypad an der R&uuml;ckseite des Joysticks herauszuf&uuml;hren.
Will man so Sachen wie Dauerfeuer mu&szlig; man sich die Schaltung die sich daf&uuml;r
im Joystickbefindet selbst ansehen. Da die immer etwas anders sind kann ich
da leider keine Auskunft geben.</P>




<P><U>Ende</U></P>


<P ALIGN=justify>Dies war meine Idee zu Thema Joystick am Jaguar. Leider ist es ohne Bilder
immer schwer so etwas zu erkl&auml;ren. Falls Fragen auftreten, kann man sich
auch an mich wenden. Ich werde versuchen alles(!) so schnell wie m&ouml;glich zu
beantworten.</P>
<A NAME="adresse">
<P>Erreichbar bin ich &uuml;ber folgende EMail Adresse:</P>

<P>Internet:  <A HREF="mailto:Holger_Haslbeck@LA.MAUS.DE" name=adresse>Holger_Haslbeck@LA.MAUS.DE</A></P>


<P>Wichtig!!</P>

<P ALIGN=justify>Weder der Autor noch die Redaktion des JaguarMag garantieren f&uuml;r die
Richtigkeit der hier gemachten Angaben. Der Umbau geschieht auf eigene Gefahr.</P>

<P ALIGN=justify>Es mu&szlig; darauf hingewiesen werden, da&szlig; beim &Ouml;ffnen/Umbau des Jyopads/Joysticks
eine gegebenenfalls noch vorhandene Garantie verloren geht!</P>



<HR>

</BODY>

</HTML>